{"_id":"post-c77cf242-56fc-46af-93ee-e88dc0498c88","_type":"post","title":"Anyone Can Code - A 2nd Grade Teacher’s Journey into the Coding World (Week 1)","slug":{"_type":"slug","current":"anyone-can-code-week1"},"body":[{"_key":"13af3025c399","children":[{"_type":"span","marks":[],"text":"What do you think of when you hear the word “code” or when someone says they are “coding”? No, I am not talking about speaking in code, morse code, or family code words. So, what is coding anyways? Coding is just giving computers and other machines instructions on actions to perform. Coding is how humans communicate with machines, and it allows for the creation of websites, computer programs, and apps. Today’s job market is full of tech careers that require this skill. But what about the novice like me without engineering experience or the skill set to create something out of essentially nothing but digits? Is it possible for me to create something out of nothing in just six weeks (and just a few hours each week)?","_key":"13af3025c3990"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"218c2a7663b7","children":[{"_type":"span","_key":"218c2a7663b70","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"5b3c8c357689","children":[{"_type":"span","marks":[],"text":"My background is in elementary education. Before I had a family, I taught 2nd grade. My biggest exposure to coding was one day a year during Computer Science Education Week when my students would be introduced to the “Hour of Code” through simple coding websites on their own. When I told my husband I was going to learn coding from the ground up, he looked at me like I was crazy and said how hard that was going to be in such a short period of time.","_key":"5b3c8c3576890"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"e12ea001f75f","children":[{"_type":"span","marks":[],"text":"Well, here I am experimenting to see how easy (or hard) it will be to create a working web page in just six weeks using code. My goal is to create a web page that contains a holiday “e-card” with pictures and family updates, a happy alternative to sending holiday cards to people all over the world without the hassle of printing and stamps. My husband’s career has us moving constantly so the people we know are scattered all around the country. An e-card allows me to share our family memories without having to keep track of all those mailing addresses!","_key":"e12ea001f75f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"eff1a237b7f7","children":[{"_type":"span","marks":[],"text":"My plan is to use HTML and CSS (more on those later...) to build a simple web page. The skills I hope to learn through this project could transfer to creating any kind of web page, such as truly personal digital party invites (talk about savings on stamps and cards and so much more personal than those e-card sites!), a blog, or a business website.","_key":"eff1a237b7f70"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a6054da88d64","children":[{"_type":"span","marks":[],"text":"I have broken down the next six weeks into short term goals. First, I need to plan and research what tools I will use for website building, find helpful tutorials or videos to guide me through the basics, and figure out how to buy a website domain. For those of you wondering, a website domain is anything that comes after the “www.” when typing a website. Domains have to be unique so it may take me some time to find one that works for me and my project. Next, I plan to learn the basics of two different programming languages, HTML and CSS. This will take time, tutorials, and outside resources.","_key":"a6054da88d640"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c13e4717b661","children":[{"_type":"span","marks":[],"text":"This is where Repl.it comes into play. Repl.it allows anyone to code for free in their browser, in all the most popular programming languages, and with no setup. It’s super easy for beginners (and pros too!) and you can even host your website or app. Does that all sound like gibberish to you too? Essentially, Repl.it allows you to code in 50+ programming languages using their in-browser IDE (Integrated Development Environment). An IDE is basically just a place to write code plus some tools to make coding easier and more powerful. You don’t have to waste time learning tons of different tools or getting lost in complicated setups and installations. And did I mention the best part? It’s free!","_key":"c13e4717b6610"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"36d4ceb07494","children":[{"_type":"span","marks":[],"text":"Motivation is key to any project, especially something brand new. I will have help from a few experts to guide me to what types of tutorials and resources I should use (I will be sharing these with you too). A task like this is not something that will magically appear overnight. It will be a step-by-step process that involves a lot of learning, creating, fixing, re-creating, and testing and hopefully an end product that is functional and aesthetically appealing.","_key":"36d4ceb074940"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"45f56dc7b759","children":[{"_type":"span","marks":[],"text":"I’m excited to share my journey with you over these next six weeks! (Find week two's post ","_key":"45f56dc7b7590"},{"_type":"span","marks":["afbfe0389f62"],"text":"here","_key":"45f56dc7b7591"},{"_type":"span","marks":[],"text":").","_key":"45f56dc7b7592"}],"markDefs":[{"_key":"afbfe0389f62","_type":"link","href":"https://blog.repl.it/anyone-can-code-week2"}],"_type":"block","style":"normal"},{"_key":"28d7a0ef84d3","children":[{"_type":"span","marks":[],"text":"P.S. If you’ve got any friends or family members who you think would like to follow along (or who have been talking about making a website or trying to understand what is this “coding” thing), please share!","_key":"28d7a0ef84d30"}],"markDefs":[],"_type":"block","style":"normal"}]}