{"_id":"post-96255c43-3ece-45b8-8ed5-f15fe6487d7f","_type":"post","title":"Reorder Assignments with Teams for Education","slug":{"_type":"slug","current":"assignment-reordering"},"body":[{"_key":"15f705fe5bc0","children":[{"_type":"span","marks":[],"text":"At Repl.it our mission is to make programming more accessible, and the best way we found to achieve this is to support, you, the teachers on the ground doing working with students. That's why we want to make sure you control the student experience and today we're making it possible to control the assignments order from your classroom dashboard.[](preview end)","_key":"15f705fe5bc00"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"73577def73de","children":[{"_type":"span","marks":[],"text":"We're giving you seven different sorting options: Alphabetic (both a-z and z-a), Publish date (both old-new and new-old), Due date (both sooner-later and later-sooner) and finally, Manual where you'll be able to drag and drop assignments in any order.","_key":"73577def73de0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4094bb33b7df","children":[{"_type":"span","marks":[],"text":"Additionally, we're unifying the teacher’s and the student’s classroom dashboard by allowing you to choose any reordering option. That means both sides will see the same assignments order on their classroom dashboard which avoids any kind of confusion between the teacher and the students.","_key":"4094bb33b7df0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f3153483d955","children":[{"_type":"span","marks":[],"text":"To remove any friction at the students' end we're removing the sorting options in the student dashboard. Students will receive the order that their teacher chose for them; and soon this will allow teachers to add assignment dependencies which will require students to complete their assignment before moving to the next one.","_key":"f3153483d9550"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"fecb704c0e5d","children":[{"_type":"span","marks":[],"text":"And as always, here is a gif of how it looks like:","_key":"fecb704c0e5d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7e2f92defa69","children":[{"_type":"span","_key":"7e2f92defa690","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2017-01-19T08:00:00.000Z"}