{"_id":"post-3a498555-6f3a-4cc5-b0d0-cf251879fe12","_type":"post","title":"Replit Case Study - Catalyst Coding Club","slug":{"_type":"slug","current":"case_study_catalyst"},"body":[{"_key":"b7fd420c2986","children":[{"_type":"span","marks":[],"text":"Realizing the lack of exposure to STEM skills for younger students, a group of high school students started ","_key":"b7fd420c29860"},{"_type":"span","marks":["aa25eed6e4cf"],"text":"Catalyst","_key":"b7fd420c29861"},{"_type":"span","marks":[],"text":", a club to introduce students all ages to CS and making sure it is accessible for everyone. Located in Redmond WA, Catalyst strives to produce an environment in which students can thrive and become passionate about the technological world. It is our goal to help ensure students in our community get the exposure they need to computer science and make an informed decision about their future careers.","_key":"b7fd420c29862"}],"markDefs":[{"_key":"aa25eed6e4cf","_type":"link","href":"https://forcatalyst.weebly.com/"}],"_type":"block","style":"normal"},{"_key":"9f6d0f7e5829","children":[{"_type":"span","marks":[],"text":"Working on projects and organizing discussions are only a couple of the ways we go about exploring computer science. Whether it is the intricacies of a Python Loop, the making of a div in HTML, or the application programming in Java, we strive to inspire genuine interest in our students over the span of a school year.","_key":"9f6d0f7e58290"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c88dc9dc1ea2","children":[{"_type":"span","_key":"c88dc9dc1ea20","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"36933ce038cf","children":[{"_type":"span","marks":[],"text":"With the rise of COVID-19 in the United States, many states were forced to shut down schools and resume operations online. This has been detrimental to the learning capabilities of students, especially the younger ones. Now that most resources have been moved online, schools and organizations have been looking for programs that can help aid them in teaching various concepts to students and help those especially at a younger level learn about various concepts using simulations. Our organization was many of many that needed a way of teaching coding online to our students. Transitioning to online learning as a club has been difficult for us because usually in a normal environment, we would be able to help students debug their issues in person. Adding on to that most of the issues beginners and students face is with the editor itself.","_key":"36933ce038cf0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"dee2709356f7","children":[{"_type":"span","marks":[],"text":"We searched for resources that can help us teach these passionate students about CS for several weeks, and that is when we stumbled upon Repl.it. Repl.it is a solution that fixed most, if not all of our problems. We didn’t have to worry about editor issues thanks to the built-in editor Repl.it has that supports several languages, from Python to Java to HTML. Not only does it have a built-in editor, it also has a unique suggestion system which helps us teachers pinpoint problems in the students’ code. Repl.it is built with many features that all in all really help us teach our students and make learning CS a lot easier and complex algorithms more understandable.","_key":"dee2709356f70"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"14719a5d2659","children":[{"_type":"span","marks":["strong"],"text":"The Editor:","_key":"14719a5d26590"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f3ecf200b8f7","children":[{"_type":"span","marks":[],"text":"Repl.it’s editor is one of the best web-based editors on the internet. It is efficient and is built with lots of integrated tools making coding less of a tedious task, which can sometimes be a problem with some other editors. The editor is web-based as well (with desktop performance), meaning that anyone with a stable internet connection can access its resources and can start coding right away. Another upside to the editor is that you can start working in specific programming languages with the click of a button. Usually, a programmer would have to download several editors, one for each language, that would eventually take up a lot of space on their computers. With repl.it you don’t even have to setup your environment, which is one of the more common issues beginners face when learning to program.","_key":"f3ecf200b8f70"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"be35d89b6a36","children":[{"_type":"span","marks":["strong"],"text":"Live code editing/multiplayer:","_key":"be35d89b6a360"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"9c1dfea01159","children":[{"_type":"span","marks":[],"text":"The use of live coding is something we have used to its fullest extent. One of the biggest advantages of being in a classroom when learning CS is getting some hands-on experience. Traditionally, when students are presented with a problem, they get a change to discuss it with their peers and then solve the problem. This helps increase communication and solidify a lot of the core concepts needed. But during the transition to online learning, this has been lost. When we first switched to online learning, our classes mostly involved the teacher talking through problems and solutions with the occasional student question. But because of live code editing, students get to have conversations with each other when solving problems. The teacher introduces a problem and the students solve it with each other's help, rather than us giving them the solutions. This makes the classes a lot more dynamic and helps make sure students develop a lot of the key communication and problem-solving skills they need for the industry.","_key":"9c1dfea011590"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6fcd6e948de4","children":[{"_type":"span","marks":["strong"],"text":"Extra resources teachers can use:","_key":"6fcd6e948de40"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"0d36883e0512","children":[{"_type":"span","marks":[],"text":"Repl.it makes it a lot easier for teachers to assign different tasks as well. With repl.it teachers can assign homework directly from the website which shows up as an assignment for the student to complete, with a given due date. We can check-in on the students' progress throughout to ensure everyone is on track. Furthermore, we can add annotations to code, which serve as comments without affecting the student's code.","_key":"0d36883e05120"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"3bce883e2358","children":[{"_type":"span","marks":[],"text":"Using repl.it for the past few months, we've been able to make remote learning a seamless experience for students of every age. It allows for teachers and students to work on programs together in real-time, annotate their code, and even create customized homework assignments. Repl.it has allowed us to encourage students (even with little to no prior experience) to pursue computer science, and we constantly discover new features that make our lessons incredibly engaging and interactive, and the platform has become an integral part of our classes.","_key":"3bce883e23580"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6bfc8c45fe67","children":[{"_type":"span","marks":["strong"],"text":"About Catalyst:","_key":"6bfc8c45fe670"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"e9f2c151a773","children":[{"_type":"span","marks":["em"],"text":"Catalyst is a club run by high school students to help provide relevant CS exposure to K-12 students. We have been hosting classes for our community since 2013 and have helped inspire numerous students by staying true to our mission “teaching through problem based learning.” If you would like to find out more about us please go to ","_key":"e9f2c151a7730"},{"_type":"span","marks":["em","2e0c89da6f61"],"text":"https://forcatalyst.weebly.com/","_key":"e9f2c151a7731"},{"_type":"span","marks":["em"],"text":".","_key":"e9f2c151a7732"}],"markDefs":[{"_key":"2e0c89da6f61","_type":"link","href":"https://forcatalyst.weebly.com/"}],"_type":"block","style":"normal"},{"_key":"4af6f1c11ffd","children":[{"_type":"span","marks":["em"],"text":"Science infinity is the parent company of Catalyst, and you can find out more here: ","_key":"4af6f1c11ffd0"},{"_type":"span","marks":["em","52ecb37c32f9"],"text":"https://science-infinity.wixsite.com/home","_key":"4af6f1c11ffd1"}],"markDefs":[{"_key":"52ecb37c32f9","_type":"link","href":"https://science-infinity.wixsite.com/home"}],"_type":"block","style":"normal"}],"publishedAt":"2021-03-11T08:15:20.856Z"}