{"_id":"post-9b421d75-d94a-4331-8986-71d3049267a4","_type":"post","title":"Using Repl.it as a CMS","slug":{"_type":"slug","current":"cms"},"body":[{"_key":"f0037e6a3fe7","children":[{"_type":"span","marks":[],"text":"At Repl.it, we try to dogfood (use our own product) as much as we can. Parts of Repl.it are already developed on / hosted entirely on itself-- our blog, our docs, and even our new UI library is being developed almost entirely on Repl.it. But one interesting use case we’re exploring now is using Repl.it as a CMS for all of our new marketing pages.","_key":"f0037e6a3fe70"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"0f3031d4a29b","children":[{"_type":"span","marks":[],"text":"The previous issue with our marketing pages was that they took a long time to update. Their content, templates, and assets all lived in our main web-app repository, so any updates made would usually take at least 30 minutes to go to live. This made changing minor details laborious and discouraged design iteration. As programmers, we've internalized version control and build pipelines, but really Repl.it offers what we've needed for this all along: the ability to make a change and see it right away.","_key":"0f3031d4a29b0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"aec859e318d4","children":[{"_type":"span","marks":[],"text":"A simple solution that a lot of websites take now is to serving marketing content from an API-first CMS like Contentful. Contentful is a great product; it allows non-developers to easily edit content on the web and instantly creates APIs for developers to use. It’s simple, fast, and robust for many use cases.","_key":"aec859e318d40"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6bebb43135a6","children":[{"_type":"span","marks":[],"text":"But it’s limited. If your data model for your content includes nested content / content trees (like a JSON object) there isn't a straightforward way to model it in Contentful except to actually write JSON or to use workarounds. Even Contentful ","_key":"6bebb43135a60"},{"_type":"span","marks":["448cac47ba2d"],"text":"has written about it.","_key":"6bebb43135a61"}],"markDefs":[{"_key":"448cac47ba2d","_type":"link","href":"https://www.contentful.com/blog/2015/02/17/content-trees-tags-and-facets-in-contentful/"}],"_type":"block","style":"normal"},{"_key":"32691eb713f6","children":[{"_type":"span","_key":"32691eb713f60","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"79f0fef3a72f","children":[{"_type":"span","marks":[],"text":"Our small Contentful app was basically just acting like a hosted JSON object. Lo and behold, there’s actually a product I use daily that’s perfect for creating APIs and serving hosted JSON.","_key":"79f0fef3a72f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c09ca9ef4810","children":[{"_type":"span","marks":[],"text":"We ditched the Contentful approach and just created an HTML repl on Repl.it and put all of our content as JSON files in there. In less than a minute, we had a CMS running on Repl.it and setup our React templates to call it. Best of all, since the repl is an actual computing environment, we can run scripts on each update (like clearing our Cloudflare cache). If you want even more control, you could create a Node.js repl and host content from there.","_key":"c09ca9ef48100"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7c8d82c49f1b","children":[{"_type":"span","_key":"7c8d82c49f1b0","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f7653816e232","children":[{"_type":"span","marks":[],"text":"You can check it out ","_key":"f7653816e2320"},{"_type":"span","marks":["7b75426cdc62"],"text":"here","_key":"f7653816e2321"},{"_type":"span","marks":[],"text":" (it’s a work in progress as we roll out our new marketing pages!). Of course, the editing experience isn’t ideal and not as finely polished as dedicated CMS services like Contentful. But at the end of the day, we’re a small team and are all comfortable writing and reading JSON, and updates to content and assets takes seconds. Soon, we’re planning on building a form renderer that lets you render JSON as a GUI, so editing will be even smoother shortly. If you’re a team looking for a lightweight solution to a hosted CMS with the power of a full computing environment, give it a try and ","_key":"f7653816e2322"},{"_type":"span","marks":["77fd1a3621b0"],"text":"sign up","_key":"f7653816e2323"},{"_type":"span","marks":[],"text":" if you haven't!","_key":"f7653816e2324"}],"markDefs":[{"_key":"7b75426cdc62","_type":"link","href":"https://repl.it/@tangert/marketing-content-server"},{"_key":"77fd1a3621b0","_type":"link","href":"https://repl.it/signup"}],"_type":"block","style":"normal"}],"publishedAt":"2020-03-23T00:00:00.000Z"}