{"_id":"post-fe3468be-e8a9-4217-b17c-8b59d4e454de","_type":"post","title":"Building the future of collaborative coding","slug":{"_type":"slug","current":"collaborative-coding"},"body":[{"_key":"9a975485f694","children":[{"_type":"span","marks":[],"text":"One of the most powerful aspects of Replit is the ability to collaborate with friends and peers in real time. When we first added support for ","_key":"9a975485f6940"},{"_type":"span","marks":["8603493e613d"],"text":"multiplayer","_key":"9a975485f6941"},{"_type":"span","marks":[],"text":", we set out to make it as easy as possible to code with others. Since then, collaboration has become an integral part of our product with the release of features like ","_key":"9a975485f6942"},{"_type":"span","marks":["2b29fc1c8a1a"],"text":"threads","_key":"9a975485f6943"},{"_type":"span","marks":[],"text":" and ","_key":"9a975485f6944"},{"_type":"span","marks":["2b48a809fee2"],"text":"draw","_key":"9a975485f6945"},{"_type":"span","marks":[],"text":".","_key":"9a975485f6946"}],"markDefs":[{"_key":"8603493e613d","_type":"link","href":"https://blog.replit.com/multi"},{"_key":"2b29fc1c8a1a","_type":"link","href":"https://blog.replit.com/threads"},{"_key":"2b48a809fee2","_type":"link","href":"https://blog.replit.com/draw"}],"_type":"block","style":"normal"},{"_key":"ac3aba6cfcdb","children":[{"_type":"span","marks":[],"text":"By continuing to improve the multiplayer experience on Replit, our goal is to dispel the myth that programming is a lonely activity. Instead, we aim to remove the barriers that impede the learning, creativity, and fun that collaboration often fosters.","_key":"ac3aba6cfcdb0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2d63c253689d","children":[{"_type":"span","marks":[],"text":"This is why we're excited to announce two new features that make collaborating on Replit even easier: Observation Mode and Filetree Presence!","_key":"2d63c253689d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2e765ce05be8","children":[{"_type":"span","marks":[],"text":"Observation Mode","_key":"2e765ce05be80"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"eb7f54b39ca9","children":[{"_type":"span","marks":[],"text":"Oftentimes, when you're coding with someone, you might want to follow their progress more closely. Whether you're teaching a class, hacking with friends, or leading an interview, it can be useful to zoom in on a collaborator's activity to see what they're working on. Previously, you might have done this by hopping on a video call and sharing your screen, but that can be overkill in many scenarios. Luckily, there's now an even easier approach built right into Replit called Observation Mode!","_key":"eb7f54b39ca90"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"cc354b9a97a5","children":[{"_type":"span","marks":[],"text":"To start observing someone, simply click on their avatar in the header. If you're in a larger session (4+ people) and you don't see their avatar, you can click on the more users button and find them there like so:","_key":"cc354b9a97a50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4cc1ac5a69d3","children":[{"_type":"span","marks":[],"text":"Observing someone will keep your editor in sync with theirs and follow their cursor as it moves, including when they switch files.","_key":"4cc1ac5a69d30"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"35cf9923baf5","children":[{"_type":"span","marks":[],"text":"Your editor will also be highlighted with their avatar's color and display an indicator to remind you that you're observing them. Here's what it looks like:","_key":"35cf9923baf50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"fe0589c93c20","children":[{"_type":"span","marks":[],"text":"Filetree Presence","_key":"fe0589c93c200"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"2e63d349fba9","children":[{"_type":"span","marks":[],"text":"The other feature that you might notice the next time you're in a multiplayer session with someone is Filetree Presence. With Presence, you can now see which files your collaborators are in right from the filetree! If other people are in a file or a collapsed directory, their avatars will appear next to them. As they hop around to different files, so too will their avatars. This will let you get a sense of where everyone is in the repl which can be both fun and useful when you're hacking together.","_key":"2e63d349fba90"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"988a6b443ccd","children":[{"_type":"span","marks":[],"text":"As time goes on, we plan to continue improving the multiplayer experience and removing the barriers to collaboration that many programmers still face today. In the modern internet era, more and more of our work, from design to writing, is done using cloud based software. The transition to the cloud brings with it a fundamental change to the way we work and share with others. At Replit, we believe that programming should be no different and are excited to keep pushing this future forward with features like these. We hope this helps you code and create together. Happy hacking!","_key":"988a6b443ccd0"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2021-07-09T00:00:00.000Z"}