{"_id":"post-0a535485-149a-4e75-92f2-075c1c05c300","_type":"post","title":"Speeding up Deployments with Lazy Image Streaming","slug":{"_type":"slug","current":"deployments-image-streaming"},"body":[{"_key":"ddc29805bdf8","children":[{"_type":"span","_key":"ddc29805bdf80","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f127290040e2","children":[{"_type":"span","marks":[],"text":"Replit Deployments is our new offering that allows you to quickly go from idea, to code, to production. To make the experience as seamless as possible, we built tooling to convert a Repl into a container imager which can be deployed to either a Google Cloud Virtual Machine or to Cloud Run. Early on, we started to hit some issues with large images taking too long to deploy to a virtual machine. It could take minutes to pull and unpack the container image before it could be started. There’s two angles of attack: reduce the image size or speed up the pulling of images. It's preferable to shrink the container image size; however, that is not always possible. In this post we’ll go into some of the technologies and approaches used to speed up image pulling/booting.","_key":"f127290040e20"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4daac23ed038","children":[{"_type":"span","marks":[],"text":"What is a container image?","_key":"4daac23ed0380"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"a22f22b68b4b","children":[{"_type":"span","marks":[],"text":"First, we’ll need to establish some baseline knowledge around container images. If you already know the details, you can skip this section.","_key":"a22f22b68b4b0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"68e120dff1a3","children":[{"_type":"span","marks":[],"text":"At a high level, a container image provides both a root filesystem and configuration for running a containerized workload. Inside the container, the filesystem is mounted to the root directory ","_key":"68e120dff1a30"},{"_type":"span","marks":["code"],"text":"/","_key":"68e120dff1a31"},{"_type":"span","marks":[],"text":". The root filesystem is stored as a list of multiple compressed tarballs, called layers, which are overlaid on top of each other. That is, if two layers have the same file, layers later in the list have higher precedence and their files replace the files from lower layers.","_key":"68e120dff1a32"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"1bdacff011b1","children":[{"_type":"span","marks":[],"text":"Here is a simplified view of what an image manifest looks like. It contains a list of layers which point to compressed tarball layers that comprise the root filesystem of the container.","_key":"1bdacff011b10"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a0d9d267777d","children":[{"_type":"span","marks":[],"text":"To start a container, you must first pull and unpack the image. This is done by querying the registry for the image’s manifest. The manifest contains metadata about the image and references to the layers that make up the root filesystem. The layers are then downloaded locally as part of the pull phase. Unpacking the layers depends on the backend being used, but the most common one is ","_key":"a0d9d267777d0"},{"_type":"span","marks":["c8b0003331a0"],"text":"overlay2","_key":"a0d9d267777d1"},{"_type":"span","marks":[],"text":". This backend uses ","_key":"a0d9d267777d2"},{"_type":"span","marks":["18833325b4e2"],"text":"OverlayFS","_key":"a0d9d267777d3"},{"_type":"span","marks":[],"text":", a special filesystem built into the Linux kernel, which allows each layer to be overlaid on top of the previous layer. If a file is present in both an upper and lower layer, the file in the upper layer \"wins\" and is the file that is accessible in the overlaid filesystem.","_key":"a0d9d267777d4"}],"markDefs":[{"_key":"c8b0003331a0","_type":"link","href":"https://docs.docker.com/storage/storagedriver/overlayfs-driver/#how-the-overlay2-driver-works"},{"_key":"18833325b4e2","_type":"link","href":"https://docs.kernel.org/filesystems/overlayfs.html"}],"_type":"block","style":"normal"},{"_key":"c15baa74088d","children":[{"_type":"span","marks":[],"text":"The process of downloading and unpacking large images is slow for a couple of reasons: The most obvious one is that it's network bound. Additionally, decompressing the layers can be CPU intensive. On small VMs with shared CPUs, CPU utilization can become a big issue since shared CPU VM offerings typically throttle the CPU after enough sustained usage.","_key":"c15baa74088d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2bdcfef61f58","children":[{"_type":"span","_key":"2bdcfef61f580","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"758d9a040499","children":[{"_type":"span","marks":[],"text":"Again, the best solution to improve image pulling speeds is to make the image smaller. Use slimmer base images and don’t copy files you don’t need, there’s many resources online on how to optimize depending on which tools and languages you are using. However, in our case, we want to avoid making the user write optimized Dockerfiles and we want to be general enough to deploy any Repl. While we continue to optimize the image size, it became clear that optimizing image pulling may be a faster approach to get improved deployment times.","_key":"758d9a0404990"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4eb1e3154e88","children":[{"_type":"span","marks":[],"text":"Lazy Image Streaming","_key":"4eb1e3154e880"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"2fb0a908f84a","children":[{"_type":"span","marks":[],"text":"In practice, containers don’t use all of the files in the image’s file system. Yet, normally, the container cannot start until the full filesystem is pulled and unpacked. What if we could start the container before the image was fully downloaded? It turns out that this is possible and there are many different projects implementing this. Most of these projects utilize a special “filesystem” in the linux kernel called ","_key":"2fb0a908f84a0"},{"_type":"span","marks":["2f95989db39b"],"text":"FUSE (Filesystem in Userspace)","_key":"2fb0a908f84a1"},{"_type":"span","marks":[],"text":". This feature allows user-space processes to implement the filesystem. The kernel will forward all filesystem requests to the FUSE process which will then handle the request.","_key":"2fb0a908f84a2"}],"markDefs":[{"_key":"2f95989db39b","_type":"link","href":"https://en.wikipedia.org/wiki/Filesystem_in_Userspace#:~:text=Filesystem%20in%20Userspace%20(FUSE)%20is,systems%20without%20editing%20kernel%20code"}],"_type":"block","style":"normal"},{"_key":"d75e2167957b","children":[{"_type":"span","marks":[],"text":"FUSE allows decoupling the container’s root file system from downloading the file system itself. As file system requests are made (i.e. readdir/open/read) the FUSE process can download the files and directory metadata on demand instead of needing them up-front. However, compressed tarballs do not provide random access to the files inside. This is a problem if we want to pull files on demand. To address this problem, there are a couple of approaches: convert the image into a format that is seekable or push additional metadata that makes existing images seekable. These are the approaches taken by the eStargz Snapshotter and the SOCI snapshotter, respectively.","_key":"d75e2167957b0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4add2d8dcc90","children":[{"_type":"span","marks":[],"text":"To go back to our earlier diagram, with FUSE, our container startup can look like this. First we download some table of contents (TOC), then we can start the container and continue to download the layers in the background:","_key":"4add2d8dcc900"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"99ebfdcf80ed","children":[{"_type":"span","marks":[],"text":"Stargz Snapshotter","_key":"99ebfdcf80ed0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"9e6bdd925576","children":[{"_type":"span","marks":[],"text":"The first lazy image streaming solution we looked at was ","_key":"9e6bdd9255760"},{"_type":"span","marks":["202d055ca7ed"],"text":"stargz snapshotter","_key":"9e6bdd9255761"},{"_type":"span","marks":[],"text":". This snapshotter requires container images to be stored in the container registry in a special, eStargz, format which is more seekable than traditional container images. eStargz stands for \"extended seekable .tar.gz\". This format produces a compressed tarball which is seekable while still being compatible with existing .tar.gz extractors.","_key":"9e6bdd9255762"}],"markDefs":[{"_key":"202d055ca7ed","_type":"link","href":"https://github.com/containerd/stargz-snapshotter"}],"_type":"block","style":"normal"},{"_key":"b7ea99663968","children":[{"_type":"span","marks":[],"text":"The eStargz format is seekable through a couple of tricks:","_key":"b7ea996639680"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c05c2694982e","children":[{"_type":"span","marks":[],"text":"Each file is individually compressed and then concatenated together, as both tar and gz format support concatenation. This allows each file to be individually decompressed.","_key":"c05c2694982e0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"e355ae0bdf3c","children":[{"_type":"span","marks":[],"text":"A table of contents is included in a known location which allows the snapshotter to find the location of any file inside the layer without needing to read the whole layer.","_key":"e355ae0bdf3c0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"dc54991fc7b5","children":[{"_type":"span","marks":[],"text":"Read more details about the eStargz format ","_key":"dc54991fc7b50"},{"_type":"span","marks":["f8db00cc27ae"],"text":"here","_key":"dc54991fc7b51"},{"_type":"span","marks":[],"text":".","_key":"dc54991fc7b52"}],"markDefs":[{"_key":"f8db00cc27ae","_type":"link","href":"https://github.com/containerd/stargz-snapshotter/blob/main/docs/estargz.md"}],"_type":"block","style":"normal"},{"_key":"9638af79154c","children":[{"_type":"span","marks":[],"text":"With this format, a FUSE filesystem can fetch the table of contents of each layer and construct a small database of file metadata for the container's root filesystem. When files are read, the filesystem can load each file individually by using ","_key":"9638af79154c0"},{"_type":"span","marks":["code","d4de3a65cf25"],"text":"Range","_key":"9638af79154c1"},{"_type":"span","marks":[],"text":" requests to the container registry. In the background the filesystem can also continue to download files even if they haven’t been accessed yet to help speed up runtime in case those files are needed in the future.","_key":"9638af79154c2"}],"markDefs":[{"_key":"d4de3a65cf25","_type":"link","href":"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Range"}],"_type":"block","style":"normal"},{"_key":"d28aa7579347","children":[{"_type":"span","marks":[],"text":"The main drawback of the stargz snapshotter is that it requires modifying the container images themselves. So it is not directly compatible with existing container images. While it is great that stargz images are compatible with regular runtimes, you will still likely need to run a conversion step. Additionally, compressing each file individually leads to worse compression ratios and can result in larger images, especially if the filesystem contains many small files.","_key":"d28aa75793470"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c7ad5dfce90f","children":[{"_type":"span","marks":[],"text":"SOCI Snapshotter","_key":"c7ad5dfce90f0"}],"markDefs":[],"_type":"block","style":"h3"},{"_key":"f0824af90d0c","children":[{"_type":"span","marks":[],"text":"Some folks were not satisfied with having to convert all container images to this new format in order to take advantage of lazy streaming. The ","_key":"f0824af90d0c0"},{"_type":"span","marks":["5141f9bac0b5"],"text":"SOCI snapshotter","_key":"f0824af90d0c1"},{"_type":"span","marks":[],"text":" is a fork of the stargz snapshotter from AWS Labs. SOCI (Seekable OCI) stores additional metadata in the container registry next to the container images themselves which provide the needed metadata to seek into a traditional OCI container image. This approach requires no modification to the original image.","_key":"f0824af90d0c2"}],"markDefs":[{"_key":"5141f9bac0b5","_type":"link","href":"https://github.com/awslabs/soci-snapshotter"}],"_type":"block","style":"normal"},{"_key":"0725cbce4bfb","children":[{"_type":"span","marks":[],"text":"So how do we seek into a .tar.gz without changing the format?","_key":"0725cbce4bfb0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"51b3ccee17fe","children":[{"_type":"span","marks":[],"text":"First, we still need a table of contents, this is the easy part: You can read the whole layer and record all the files present in the layer and their metadata. However, we still need a way to randomly access these files from the compressed layer.","_key":"51b3ccee17fe0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"3cf5b6471437","children":[{"_type":"span","marks":[],"text":"SOCI uses ","_key":"3cf5b64714370"},{"_type":"span","marks":["dbe4dec83fa8"],"text":"“zTOC”s","_key":"3cf5b64714371"},{"_type":"span","marks":[],"text":" (gzip table of contents) to provide resumable checkpoints in the gzip stream and a table of contents of the underlying tarball. Gzip [de]compression is stateful and relies on a sliding window of the decompressed data when [de]compressing. The zTOC records all the states of the decompression at multiple checkpoints within the compressed stream and it includes the offset in both the compressed and decompressed views of the payload. To decompress a portion of the stream, you only need to restore the state of the decompressor at one of the checkpoints and continue decompression. If you’re curious about how this works, check out our ","_key":"3cf5b64714372"},{"_type":"span","marks":["8dfefd43579e"],"text":"implementation of zTOC generation","_key":"3cf5b64714373"},{"_type":"span","marks":[],"text":".","_key":"3cf5b64714374"}],"markDefs":[{"_key":"dbe4dec83fa8","_type":"link","href":"https://github.com/awslabs/soci-snapshotter/blob/main/docs/glossary.md"},{"_key":"8dfefd43579e","_type":"link","href":"http://github.com/replit/ztoc-rs/"}],"_type":"block","style":"normal"},{"_key":"27a880d6699d","children":[{"_type":"span","marks":[],"text":"To randomly access a file, the file can be located from the table of contents which will include the location of the file in the decompressed payload. Using the offset of the file and the zTOC, the bookend gzip checkpoints can be located and only the portion of the layer between those checkpoints needs to be downloaded.","_key":"27a880d6699d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8eb7e8223293","children":[{"_type":"span","marks":[],"text":"With zTOCs, SOCI can acheive the same functionality as the stargz snapshotter but without requiring image modification or a reduction in compression ratio.","_key":"8eb7e82232930"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6346aca2ce11","children":[{"_type":"span","marks":[],"text":"We decided to go with this approach because we liked that we could try this out without needing to alter our existing images and that we could avoid individually compressing every file sine our images may contain many small files.","_key":"6346aca2ce110"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"89ec8f8fa387","children":[{"_type":"span","marks":[],"text":"Tradeoffs","_key":"89ec8f8fa3870"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"307f9a178bde","children":[{"_type":"span","marks":[],"text":"Lazy image streaming comes with some trade-offs, the main one is that FUSE is much slower than a normal filesystem. Each filesystem operation must go from userspace, to kernel space, to userspace (FUSE daemon), to kernel space, and finally back to userspace. This overhead is incurred on every filesystem operation. So while your container may have faster cold start times, the performance at runtime may be worse if the application is relying on heavy use of the container's root file system. Always perform your own testing to see if this tradeoff is worthwhile for your application.","_key":"307f9a178bde0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"221b9d703835","children":[{"_type":"span","marks":[],"text":"Results","_key":"221b9d7038350"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"66a2317d52e9","children":[{"_type":"span","marks":[],"text":"Without lazy image streaming enabled, it used to take 3-4 minutes for some Repls to cold boot in the VM. With SOCI snapshotter enabled, we can now cold boot the container in under 30 seconds even on small VMs with a small number of vCPUs.","_key":"66a2317d52e90"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"073fb514d15a","children":[{"_type":"span","marks":[],"text":"Cloud Run deployments also benefit from a similar technology that Google has developed which also provides image streaming transparently for images hosted by Artifact Registry. This same feature can be enabled for Google Kubernetes Engine (GKE), you can read more about that ","_key":"073fb514d15a0"},{"_type":"span","marks":["955200e5eec6"],"text":"here","_key":"073fb514d15a1"},{"_type":"span","marks":[],"text":".","_key":"073fb514d15a2"}],"markDefs":[{"_key":"955200e5eec6","_type":"link","href":"https://cloud.google.com/kubernetes-engine/docs/how-to/image-streaming"}],"_type":"block","style":"normal"},{"_key":"057a05df7bf7","children":[{"_type":"span","marks":[],"text":"Utilizing image streaming, we were able to cut over 3 minutes from Repl deployment times. We’ll continue to optimize our image building process and deployment flow to make deployments even faster in the future.","_key":"057a05df7bf70"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"462b14fffe27","children":[{"_type":"span","marks":[],"text":"Come work with us","_key":"462b14fffe270"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"1da9ce2e72a8","children":[{"_type":"span","marks":[],"text":"If diving deep into the layers of containers, microVMs, and the Linux kernel is your thing, consider ","_key":"1da9ce2e72a80"},{"_type":"span","marks":["c79916a34e45"],"text":"working with us","_key":"1da9ce2e72a81"},{"_type":"span","marks":[],"text":" to build the best platform for going from idea, to code, to production.","_key":"1da9ce2e72a82"}],"markDefs":[{"_key":"c79916a34e45","_type":"link","href":"https://replit.com/site/careers"}],"_type":"block","style":"normal"}],"publishedAt":"2023-09-06T00:00:00.000Z"}