{"_id":"post-c9c73635-c9aa-4ec6-8ec0-5f07b92201b0","_type":"post","title":"Ethical hacking on Replit","slug":{"_type":"slug","current":"ethical-hacking-on-replit"},"body":[{"_key":"fd8894ae288e","children":[{"_type":"span","marks":[],"text":"We’re proud to say that Replit was built by and for hackers. A hacker, as defined in an ","_key":"fd8894ae288e0"},{"_type":"span","marks":["cd2f18d42457"],"text":"early Internet glossary","_key":"fd8894ae288e1"},{"_type":"span","marks":[],"text":", is “A person who delights in having an intimate understanding of the internal workings of a system, computers and computer networks in particular.” It’s this sense of curiosity and delight that motivates our community to grow and share their skills, and to show off their creations in our Community.","_key":"fd8894ae288e2"}],"markDefs":[{"_key":"cd2f18d42457","_type":"link","href":"https://www.rfc-editor.org/rfc/rfc1392.html"}],"_type":"block","style":"normal"},{"_key":"5f890e75c123","children":[{"_type":"span","marks":[],"text":"The media often misuses the word “hacker” to refer only to malicious cybercriminals. While that’s not what it means, there are some “black hat” hackers who seek to spoil the experience of others. This is true on Replit and other places - such hackers use platforms to distribute spam or malware, attack third-party services, or steal resources. That’s not part of our ethos of hacking, and those activities are prohibited by our ","_key":"5f890e75c1230"},{"_type":"span","marks":["4bcbd44954a1"],"text":"Terms of Service","_key":"5f890e75c1231"},{"_type":"span","marks":[],"text":".","_key":"5f890e75c1232"}],"markDefs":[{"_key":"4bcbd44954a1","_type":"link","href":"https://replit.com/site/terms"}],"_type":"block","style":"normal"},{"_key":"26f2fcad7ea0","children":[{"_type":"span","marks":[],"text":"With that said, the line between ethical hacking and abuse isn’t always obvious, particularly to young hackers who are just starting out. In particular, many of our users begin their programming journey on Discord, where Replit has a ","_key":"26f2fcad7ea00"},{"_type":"span","marks":["f1b6e9389bd5"],"text":"large community","_key":"26f2fcad7ea01"},{"_type":"span","marks":[],"text":". Hacking on bots to interact with Discord’s service is a great way to learn, but some of these bots have malicious functions that aren’t allowed to be hosted on Replit.","_key":"26f2fcad7ea02"}],"markDefs":[{"_key":"f1b6e9389bd5","_type":"link","href":"https://discord.util.repl.co/"}],"_type":"block","style":"normal"},{"_key":"652c3f427b1a","children":[{"_type":"span","marks":[],"text":"To make things a bit clearer, here are some examples of the most common violating repls that we come across on a daily basis, with explanations of why we don’t allow them.","_key":"652c3f427b1a0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"fb902692e952","children":[{"_type":"span","marks":["strong"],"text":"Nuke and raid bots.","_key":"fb902692e9520"},{"_type":"span","marks":[],"text":" Bots designed to disrupt Discord servers are one of the most common violating repls that we see. Because these are used to attack third-party services, we do not allow them.","_key":"fb902692e9521"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"ece32143657d","children":[{"_type":"span","marks":["strong"],"text":"Snipers and grabbers.","_key":"ece32143657d0"},{"_type":"span","marks":[],"text":" Scripts that steal credentials or tokens from other users are not allowed. A common example of this that we see are Discord Nitro snipers or generators. There’s no such thing as “free Nitro”... even if they claim to “generate” Nitro, these scripts are actually attempting to find and steal tokens that other users have already purchased. Other examples that fall into this category include token grabbers and IP loggers. These are commonly combined with “free Nitro” or “free Robux” scams, that are designed to fool users into giving up their login tokens or IP addresses by clicking on a malicious link or scanning a malicious QR code.","_key":"ece32143657d1"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"cb63aafd902a","children":[{"_type":"span","marks":["strong"],"text":"Mass DM and spam bots.","_key":"cb63aafd902a0"},{"_type":"span","marks":[],"text":" Our rules against spamming prohibit posting spam to Replit, but they also prohibit tools that are designed to spam other platforms. Mass DM bots fall into this category, and aren’t allowed.","_key":"cb63aafd902a1"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"80342914d856","children":[{"_type":"span","marks":["strong"],"text":"Phishing.","_key":"80342914d8560"},{"_type":"span","marks":[],"text":" It may seem obvious, but creating a fake version of a third party website login page to steal user credentials is absolutely not allowed on Replit. Phishing sites that simulate bank websites are taken particularly seriously. If you publish such a page, don’t expect to get off with just a warning.","_key":"80342914d8561"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"3cc3781f3a67","children":[{"_type":"span","marks":["strong"],"text":"DDoS attacks.","_key":"3cc3781f3a670"},{"_type":"span","marks":[],"text":" Repls designed to attack a third party service with a high volume of requests are not allowed. If you are writing a script that interacts with a third party website or service, make sure to rate limit your requests so that your script is not interpreted as an attack.","_key":"3cc3781f3a671"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"868c92e890aa","children":[{"_type":"span","marks":["strong"],"text":"Exploits","_key":"868c92e890aa0"},{"_type":"span","marks":[],"text":". Repls that exploit known vulnerabilities to gain unauthorized access to a third party service or to disrupt its operation are not allowed. The same applies to repls that actively scan for vulnerabilities, unless you have permission from the owner of the systems that you are scanning.","_key":"868c92e890aa1"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"fba32e8271f4","children":[{"_type":"span","marks":[],"text":"As hackers ourselves, we recognize that some of the techniques of black hat hacking are also used for benign reasons. With that in mind, here are some things that we do allow.","_key":"fba32e8271f40"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7ed2b7efe646","children":[{"_type":"span","marks":["strong"],"text":"Scripted interaction with third party websites and services","_key":"7ed2b7efe6460"},{"_type":"span","marks":[],"text":". Coding a bot to help you use your account on a third party website is generally fine with us, so long as you don’t overload the site. Examples of this would include a bot to notify you when a certain event occurs, to keep your account online, or to automate actions that you could otherwise perform manually.","_key":"7ed2b7efe6461"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"f15a1bd5c25a","children":[{"_type":"span","marks":["strong"],"text":"General-purpose security tools.","_key":"f15a1bd5c25a0"},{"_type":"span","marks":[],"text":" Tools used by security researchers are generally allowed, provided that they can’t be directly deployed in attacks. A good example of this is a password cracking tool that uses generally-applicable techniques such as brute force or dictionary attacks to guess a supplied password. Such tools are a common coding exercise, and a good way to learn about encryption.","_key":"f15a1bd5c25a1"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"6fc74935e849","children":[{"_type":"span","marks":["strong"],"text":"Private repls for authorized penetration testing.","_key":"6fc74935e8490"},{"_type":"span","marks":[],"text":" If you’re learning about network security and want to test out how common network attacks such as command injection and cross-site scripting work, the best way to do that is by using a private repl. In that way, you can ensure that the tools you’re using are only used against authorized targets. You can make as many private repls as you want for just ","_key":"6fc74935e8491"},{"_type":"span","marks":["3328397f8105"],"text":"150 Cycles per month","_key":"6fc74935e8492"},{"_type":"span","marks":[],"text":".","_key":"6fc74935e8493"}],"markDefs":[{"_key":"3328397f8105","_type":"link","href":"https://replit.com/cycles"}],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"9a4f2beb72ac","children":[{"_type":"span","marks":[],"text":"Infringing our Terms of Service can lead to a warning, or in serious cases even to a suspension or ban from using Replit. But if your code doesn’t attack a target, exploit a vulnerability, or steal a token or credential, you most likely have nothing to worry about! Feel free to learn, experiment, and have fun. If you have any questions, we’d be happy to hear from you at ","_key":"9a4f2beb72ac0"},{"_type":"span","marks":["30cefdc21d02"],"text":"contact@replit.com","_key":"9a4f2beb72ac1"},{"_type":"span","marks":[],"text":".","_key":"9a4f2beb72ac2"}],"markDefs":[{"_key":"30cefdc21d02","_type":"link","href":"mailto:contact@replit.com"}],"_type":"block","style":"normal"}],"publishedAt":"2022-08-15T00:00:00.000Z"}