{"_id":"post-ca26307e-c5ef-4462-9bb0-21494ec4677a","_type":"post","title":"Worldwide Repls, part 1: The Control Plane","slug":{"_type":"slug","current":"geo-part-1-controlplane"},"body":[{"_key":"5546f8b84d74","children":[{"_type":"span","marks":[],"text":"During ","_key":"5546f8b84d740"},{"_type":"span","marks":["a10c2cb29aa1"],"text":"the ReplCon 2022 keynote","_key":"5546f8b84d741"},{"_type":"span","marks":[],"text":", we announced that we were going to geo-distribute our infrastructure so that your Repls are much faster when accessed outside of the United States. The speed of electrons / light in a medium is a fundamental speed limit. Most of our users are several thousand kilometers away from the data centers where we host Repls (currently limited to the United States), so the round trip from them to the users' homes is going to necessarily take several hundred milliseconds just to traverse the ","_key":"5546f8b84d742"},{"_type":"span","marks":["9670088acff7"],"text":"series of tubes","_key":"5546f8b84d743"},{"_type":"span","marks":[],"text":" that is the Internet. Today, we have finished the first milestone to make this a reality, and that comes with some pretty neat side-effects!","_key":"5546f8b84d744"}],"markDefs":[{"_key":"a10c2cb29aa1","_type":"link","href":"https://www.youtube.com/watch?v=y2ktZ0heBlY"},{"_key":"9670088acff7","_type":"link","href":"https://en.wikipedia.org/wiki/Series_of_tubes"}],"_type":"block","style":"normal"},{"_key":"0f00351a3987","children":[{"_type":"span","marks":[],"text":"The control / data plane separation","_key":"0f00351a39870"}],"markDefs":[],"_type":"block","style":"h3"},{"_key":"eaa9c57c550d","children":[{"_type":"span","marks":[],"text":"Up to this point, our ","_key":"eaa9c57c550d0"},{"_type":"span","marks":["bb284ed0ace1"],"text":"infrastructure","_key":"eaa9c57c550d1"},{"_type":"span","marks":[],"text":" was designed in a way that allows for horizontal scalability: being able to have more capacity to run Repls by adding more VMs to our infrastructure. This allows us to quickly react to having more users at certain times of day without making any code changes, and is built upon having a ","_key":"eaa9c57c550d2"},{"_type":"span","marks":["428254e8161d"],"text":"Load Balancer","_key":"eaa9c57c550d3"},{"_type":"span","marks":[],"text":" that routes requests to connect to a container using the WebSockets protocol to individual VMs in our infrastructure.","_key":"eaa9c57c550d4"}],"markDefs":[{"_key":"bb284ed0ace1","_type":"link","href":"https://blog.replit.com/welcome-to-the-wonderful-world-of-clusters"},{"_key":"428254e8161d","_type":"link","href":"https://cloud.google.com/load-balancing"}],"_type":"block","style":"normal"},{"_key":"af4c6df70dc7","children":[{"_type":"span","marks":[],"text":"Some of you might remember that we had ","_key":"af4c6df70dc70"},{"_type":"span","marks":["80c66ea2be75"],"text":"announced global routing last year","_key":"af4c6df70dc71"},{"_type":"span","marks":[],"text":", which we achieved by having a small set of servers in Mumbai, India. That worked well during testing, but after enabling it for everybody we discovered an interesting edge case: since the Load Balancer is the component that decides where any WebSockets connection goes and we have little control over that whole process, ","_key":"af4c6df70dc72"},{"_type":"span","marks":["em"],"text":"sometimes","_key":"af4c6df70dc73"},{"_type":"span","marks":[],"text":" the India servers were a bit busier than servers elsewhere and the Load Balancer decided to route a connection to the United States. But what if this was a multiplayer Repl, or a reconnect to a Repl that was already running? In those cases, the VM where the request lands performs a transparent proxy of the WebSockets connection to the VM where the Repl is actually running. So now users would have to connect to a server in the United States (which was the old \"normal\"), but then ","_key":"af4c6df70dc74"},{"_type":"span","marks":["em"],"text":"that","_key":"af4c6df70dc75"},{"_type":"span","marks":[],"text":" server had to talk to a server in India, which added an unnecessary ~250ms worth of roundtrip to the previous behavior. We had accidentally made things ","_key":"af4c6df70dc76"},{"_type":"span","marks":["strong"],"text":"slower","_key":"af4c6df70dc77"},{"_type":"span","marks":[],"text":"! Sadly, we had to revert this change 😢.","_key":"af4c6df70dc78"}],"markDefs":[{"_key":"80c66ea2be75","_type":"link","href":"https://blog.replit.com/global"}],"_type":"block","style":"normal"},{"_key":"722958da3d2e","children":[{"_type":"span","marks":[],"text":"So back to the drawing board we go. What became obvious is that we had to make changes such that the Load Balancer was not the source of truth of where Repls are placed. Enter the ","_key":"722958da3d2e0"},{"_type":"span","marks":["8e4b230701c7"],"text":"Control Plane","_key":"722958da3d2e1"},{"_type":"span","marks":[],"text":". In Networking, there is a distinction between what are called ","_key":"722958da3d2e2"},{"_type":"span","marks":["23577300bb58"],"text":"Control and Data Planes","_key":"722958da3d2e3"},{"_type":"span","marks":[],"text":": where the Control Plane is concerned with making changes to the network to make sure that packets go to their destination in the best way possible at that moment, and the Data Plane is the part of the system that actually moves the internet packets (a.k.a. the data). There is also the ","_key":"722958da3d2e4"},{"_type":"span","marks":["7799788e6d73"],"text":"Management Plane","_key":"722958da3d2e5"},{"_type":"span","marks":[],"text":", which is analogous to the Control Plane but manages other non-networking systems. So for us, we wanted to have a Control / Data Plane separation to clearly distinguish making modifications to the shape of the system: making a Repl start / stop in a particular VM vs. the WebSockets communication between the Linux container and the Workspace.","_key":"722958da3d2e6"}],"markDefs":[{"_key":"8e4b230701c7","_type":"link","href":"https://twitter.com/lhchavez/status/1504575890528694280"},{"_key":"23577300bb58","_type":"link","href":"https://en.wikipedia.org/wiki/Control_plane"},{"_key":"7799788e6d73","_type":"link","href":"https://en.wikipedia.org/wiki/Management_plane"}],"_type":"block","style":"normal"},{"_key":"9853d383f76d","children":[{"_type":"span","marks":[],"text":"A new abstraction to build upon","_key":"9853d383f76d0"}],"markDefs":[],"_type":"block","style":"h3"},{"_key":"9f81f7d90dbc","children":[{"_type":"span","marks":[],"text":"Once we decided we were going to be making changes to the system, we thought about what other use cases and user-visible improvements we could unlock with this new tool. To start, now that we ","_key":"9f81f7d90dbc0"},{"_type":"span","marks":["em"],"text":"need","_key":"9f81f7d90dbc1"},{"_type":"span","marks":[],"text":" to have a central system that has a consistent view of the infrastructure, we also needed to clean up the data layer that the container-running machines were using. Previously, this was done by having a massive Redis instance for every user cluster, available directly to each machine running user code. This decision to not have an ACID-compliant store made a lot of sense back when it was made, since Replit's scale was significantly smaller. But we have outgrown the data model allowed by Redis, and it had started to hamper our growth: a single Redis instance meant that servers further away from the United States would necessarily have significantly higher latencies on every roundtrip to the data store, and the non-transactionality of Redis meant that it was difficult to get a highly consistent view of the state of any individual Repl. These two things (together with some other long-standing bugs) caused some data races that resulted in inconsistencies in our infrastructure: it was possible for a single Repl to have two containers, which leads to data loss!","_key":"9f81f7d90dbc2"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a21656c9d043","children":[{"_type":"span","marks":[],"text":"With the central Control Plane, we are now able to co-locate it with the data storage (which we have chosen to be ","_key":"a21656c9d0430"},{"_type":"span","marks":["3c9478dad6f0"],"text":"PostgreSQL","_key":"a21656c9d0431"},{"_type":"span","marks":[],"text":"). This way we can build higher level operations that mutate the state of several aspects of a Repl at once in a single network roundtrip to the Control Plane service. Also, this means that we can also request multiple bits of metadata in a single network roundtrip!","_key":"a21656c9d0432"}],"markDefs":[{"_key":"3c9478dad6f0","_type":"link","href":"https://www.postgresql.org/"}],"_type":"block","style":"normal"},{"_key":"c5c565bf3894","children":[{"_type":"span","marks":[],"text":"Normally, software rewrites are seen as a ","_key":"c5c565bf38940"},{"_type":"span","marks":["9e8e04be978b"],"text":"something you should never do","_key":"c5c565bf38941"},{"_type":"span","marks":[],"text":". But in this case it turned out to be a good decision, because this rewrite had a pretty clear purpose (unlocking a set of future functionality that was impossible to achieve with the old system), ","_key":"c5c565bf38942"},{"_type":"span","marks":["em"],"text":"and","_key":"c5c565bf38943"},{"_type":"span","marks":[],"text":" we were also able to plan this in a way to deliver value incrementally.","_key":"c5c565bf38944"}],"markDefs":[{"_key":"9e8e04be978b","_type":"link","href":"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/"}],"_type":"block","style":"normal"},{"_key":"34548047c4c4","children":[{"_type":"span","marks":[],"text":"Rolling out a huge refactor","_key":"34548047c4c40"}],"markDefs":[],"_type":"block","style":"h3"},{"_key":"5b7856aee4ba","children":[{"_type":"span","marks":[],"text":"With a design in hand, it was time to decide how to actually roll it out while minimizing regressions. To do that, we decided to use the ","_key":"5b7856aee4ba0"},{"_type":"span","marks":["d145520364ce"],"text":"strangler fig pattern","_key":"5b7856aee4ba1"},{"_type":"span","marks":[],"text":", in which a \"legacy system\" (the current implementation) and a new system that have the same interface but different implementations are called behind an abstraction layer that calls both systems in parallel and throws one response away, with ","_key":"5b7856aee4ba2"},{"_type":"span","marks":["em"],"text":"a lot","_key":"5b7856aee4ba3"},{"_type":"span","marks":[],"text":" of dynamic runtime flags to change this behavior and shut either system down in case of an emergency. This allowed us to build the implementation one API at a time, and since we had the responses of both systems, we could diff them to spot any inconsistencies to build confidence of correctness even in edge cases. This gradual enabling of the system also allowed us to better understand the resources that were needed to handle the expected load at the end, and compare the observed behavior with some initial synthetic load tests that we had written in preparation.","_key":"5b7856aee4ba4"}],"markDefs":[{"_key":"d145520364ce","_type":"link","href":"https://docs.microsoft.com/en-us/azure/architecture/patterns/strangler-fig"}],"_type":"block","style":"normal"},{"_key":"4bfdfa361703","children":[{"_type":"span","marks":[],"text":"Another advantage of doing it this way is that this allowed the data set of both databases to converge to the same values: the new system had an initial import from a backup of the old system, and from then on, it started seeing all the same requests as the old system. And since the number of inconsistencies was trending in the right direction (towards zero) as we kept implementing more APIs, we were confident that no data was being lost.","_key":"4bfdfa3617030"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"05768c35526d","children":[{"_type":"span","marks":[],"text":"When it became time to make the switch, we decided to do so on an API-by-API basis to make the change more gradual. Over the course of several weeks, we started enabling a few APIs at a time that didn't have any inconsistencies between implementations. But then it came to a point where there was just one huge API left to migrate: the one where the ","_key":"05768c35526d0"},{"_type":"span","marks":["code"],"text":".repl.co","_key":"05768c35526d1"},{"_type":"span","marks":[],"text":" serving infrastructure grabbed the metadata needed to serve hosting requests for all the Repls. That was done with an immense amount of anticipation and all the Platform engineers obsessing over metrics. When the moment of truth came, it was an extremely boring event: nothing caught on fire or broke. But a few moments later, we had strong evidence that our efforts paid off: as a side-effect, we managed to reduce the 99th percentile latency of ","_key":"05768c35526d2"},{"_type":"span","marks":["code"],"text":".repl.co","_key":"05768c35526d3"},{"_type":"span","marks":[],"text":" hosting by 66%! And not only that, we simultaneously managed to completely eliminate all duplicate containers by having the source of truth for Repls and containers in our infrastructure in an ACID-compliant data store.","_key":"05768c35526d4"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c366de8dbba6","children":[{"_type":"span","marks":[],"text":"We like to play a game at the office called \"try to guess when the change took effect\". Let's see if you can guess!","_key":"c366de8dbba60"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d67fc5cfb076","children":[{"_type":"span","_key":"d67fc5cfb0760","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2848a6b1f0f7","children":[{"_type":"span","marks":[],"text":"The future","_key":"2848a6b1f0f70"}],"markDefs":[],"_type":"block","style":"h3"},{"_key":"8240abee1951","children":[{"_type":"span","marks":[],"text":"This is not the end of the journey for Worldwide Repls. In fact, this is just the very first big launch in a series of milestones!","_key":"8240abee19510"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6f7e17ba7948","children":[{"_type":"span","_key":"6f7e17ba79480","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"922d62c98344","children":[{"_type":"span","marks":[],"text":"We are going to end with an almost completely rewritten system at the end, and at every stage of the way, we will be providing shiny improvements, either better performance or new features. Expect a lot more news about this, and we plan to have the next stage done by the fall of this year. Users in Asia should expect to see much faster Repls by then.","_key":"922d62c983440"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"abff9d44372f","children":[{"_type":"span","marks":[],"text":"And remember that we are always ","_key":"abff9d44372f0"},{"_type":"span","marks":["f6759199da50"],"text":"hiring for remote engineers","_key":"abff9d44372f1"},{"_type":"span","marks":[],"text":". So make sure to check that out. Expect another update soon!","_key":"abff9d44372f2"}],"markDefs":[{"_key":"f6759199da50","_type":"link","href":"https://replit.com/careers"}],"_type":"block","style":"normal"}],"publishedAt":"2022-07-08T17:00:00.000Z"}