{"_id":"post-9e97bb32-0935-45b8-a0d7-13049ccc7a7c","_type":"post","title":"Worldwide Repls, part 3: Firing Up The Engines","slug":{"_type":"slug","current":"geo-part-3-deploy"},"body":[{"_key":"81fec8149530","children":[{"_type":"span","_key":"81fec81495300","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"b18ba72d2e30","children":[{"_type":"span","marks":[],"text":"At Replit, we operate a cloud-based infrastructure that allows developers to collaborate and create within an all-in-one, integrated development environment. One of the most significant parts of this experience is the latency perceived by the developer when interacting with the workspace. While we can always ","_key":"b18ba72d2e300"},{"_type":"span","marks":["52ca0265dabe"],"text":"add resources such as CPU, RAM, and storage on demand","_key":"b18ba72d2e301"},{"_type":"span","marks":[],"text":", when tackling latency we have to deal with some fundamental physical limits such as the speed of light. This means that you can only do so much for latency by throwing resources at it, and at some point, you just need to bring the server closer to the end user. Given that we want to provide a platform for the next billion software creators, that means that we need to have infrastructure distributed around the world.","_key":"b18ba72d2e302"}],"markDefs":[{"_key":"52ca0265dabe","_type":"link","href":"https://docs.replit.com/power-ups/boosts"}],"_type":"block","style":"normal"},{"_key":"350f4ee13d79","children":[{"_type":"span","marks":[],"text":"While we run many of the workspace interactions, such as file editing and browsing, locally on the user's browser, many tasks still depend on communicating with your Repl running on our servers. Examples of such interactions are typing into the shell and getting ","_key":"350f4ee13d790"},{"_type":"span","marks":["062ca71c4fac"],"text":"Language Server Protocol","_key":"350f4ee13d791"},{"_type":"span","marks":[],"text":" results like catching errors and finding symbol definitions. Because these interactions require communication between the user's browser and the Repl, the only way to reduce latency is to bring the two closer together. In doing that, we also ensure that each bit of the development feedback loop remains quick and efficient, improving the experience for the user.","_key":"350f4ee13d792"}],"markDefs":[{"_key":"062ca71c4fac","_type":"link","href":"https://microsoft.github.io/language-server-protocol/"}],"_type":"block","style":"normal"},{"_key":"c4a8d039af37","children":[{"_type":"span","marks":[],"text":"Replit's platform team works hard on improving the infrastructure at the core of Replit. This includes running containers, providing hosting, managing storage, and networking. We recently made some substantial improvements to the infrastructure: dividing our infrastructure into multiple failure domains with ","_key":"c4a8d039af370"},{"_type":"span","marks":["a82b9c027855"],"text":"clusters","_key":"c4a8d039af371"},{"_type":"span","marks":[],"text":", moving our global state management from Redis to an SQL-backed ","_key":"c4a8d039af372"},{"_type":"span","marks":["bfef13611a4c"],"text":"Control Plane","_key":"c4a8d039af373"},{"_type":"span","marks":[],"text":", and creating our own ","_key":"c4a8d039af374"},{"_type":"span","marks":["51f810bdeab8"],"text":"load balancer","_key":"c4a8d039af375"},{"_type":"span","marks":[],"text":" for assigning Repls to machines. These improvements not only improve performance or minimize the surface for inconsistent states to show up, but at the end of the day, they provide an all-around superior experience to the developers on our platform. In this post, we'll give an overview of how Replit's infrastructure is organized, and then dive into detail about how we tackled the next step in improving the experience for a large number of developers: geographic distribution.","_key":"c4a8d039af376"}],"markDefs":[{"_key":"a82b9c027855","_type":"link","href":"https://blog.replit.com/welcome-to-the-wonderful-world-of-clusters"},{"_key":"bfef13611a4c","_type":"link","href":"https://blog.replit.com/geo-part-1-controlplane"},{"_key":"51f810bdeab8","_type":"link","href":"https://blog.replit.com/geo-part-2-loadbalancing"}],"_type":"block","style":"normal"},{"_key":"81a7abcc2fef","children":[{"_type":"span","marks":[],"text":"Clusters: Isolation and Ease of Management","_key":"81a7abcc2fef0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"9763bee343a7","children":[{"_type":"span","marks":[],"text":"The infrastructure that runs Repls is broken into ","_key":"9763bee343a70"},{"_type":"span","marks":["0332ff9b5ef7"],"text":"clusters","_key":"9763bee343a71"},{"_type":"span","marks":[],"text":". One important characteristic of clusters is that they are mostly isolated from each other. This means that we can manage pieces of our infrastructure separately, and it also allows us to delimit discrete ","_key":"9763bee343a72"},{"_type":"span","marks":["e62c0a4c499d"],"text":"failure domains","_key":"9763bee343a73"},{"_type":"span","marks":[],"text":". This means that, instead of affecting all users, outages and transient instabilities only affect a section of them. Partitioning users and, as a result, Repls between clusters, proved to be an important primitive that allowed us to break apart our infrastructure into pieces that can be deployed and managed in an isolated manner. Clusters turned out to be a huge success in terms of partitioning out infrastructure into discrete failure domains and providing a better experience for developers as the number of Repls grew.","_key":"9763bee343a74"}],"markDefs":[{"_key":"0332ff9b5ef7","_type":"link","href":"https://blog.replit.com/welcome-to-the-wonderful-world-of-clusters"},{"_key":"e62c0a4c499d","_type":"link","href":"https://en.wikipedia.org/wiki/Failure_domain"}],"_type":"block","style":"normal"},{"_key":"c1336c551ca9","children":[{"_type":"span","_key":"c1336c551ca90","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"91b9d6fcf311","children":[{"_type":"span","marks":[],"text":"We expected the notion of clusters to be easily extended to support geographic replication. We did not impose a regional constraint on clusters, meaning that each cluster was spread out across multiple regions. For instance, for the free-tier cluster, we had pieces of the infrastructure running in ","_key":"91b9d6fcf3110"},{"_type":"span","marks":["code"],"text":"us-central1","_key":"91b9d6fcf3111"},{"_type":"span","marks":[],"text":", ","_key":"91b9d6fcf3112"},{"_type":"span","marks":["code"],"text":"us-east1","_key":"91b9d6fcf3113"},{"_type":"span","marks":[],"text":", and so forth. Ditto for all the other clusters. We architected our infrastructure so that, in theory, it doesn't matter which piece of infrastructure is running on which region, so that we don't have to worry about where a Repl is stored or in which machine a Repl is run when launched. This means that adding machines in regions outside the US should be easy right?","_key":"91b9d6fcf3114"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"cf269f1a62d7","children":[{"_type":"span","marks":[],"text":"Our First Attempt at Geographic Distribution","_key":"cf269f1a62d70"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"467afb180ae4","children":[{"_type":"span","marks":[],"text":"Our first attempt at creating a geographically distributed infrastructure was done by creating regional instances of each cluster in different locations around the world. So if we had ","_key":"467afb180ae40"},{"_type":"span","marks":["code"],"text":"hacker-us-east1","_key":"467afb180ae41"},{"_type":"span","marks":[],"text":", we could easily add, for instance, ","_key":"467afb180ae42"},{"_type":"span","marks":["code"],"text":"hacker-asia-south1","_key":"467afb180ae43"},{"_type":"span","marks":[],"text":". We took a stab at it and implemented this for internal testing. The results were not good, however.","_key":"467afb180ae44"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"48555fec77c5","children":[{"_type":"span","_key":"48555fec77c50","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"11ea53899b34","children":[{"_type":"span","marks":[],"text":"We added conman machines for running Repls (containers) in the ","_key":"11ea53899b340"},{"_type":"span","marks":["code"],"text":"asia-south1","_key":"11ea53899b341"},{"_type":"span","marks":[],"text":" GCP (Google Cloud Platform) region. This means that the actual piece of infrastructure with which developers directly interact will be closer to them. However, other pieces of the infrastructure were still located in the North American continent.","_key":"11ea53899b342"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c051fbbe1d5f","children":[{"_type":"span","marks":[],"text":"A quick primer on how connections between developers and Repls are handled. We start off with some information exchange between the user's browser and our web server in order to mint a token. After this initial negotiation, the user's browser hits a certain endpoint handled by the GCP load balancer. The load balancer then picks some conman machine for your Repl to run in. At this point, we initiate a ","_key":"c051fbbe1d5f0"},{"_type":"span","marks":["5f08bfedb36b"],"text":"WebSocket","_key":"c051fbbe1d5f1"},{"_type":"span","marks":[],"text":" connection between the user and the machine running the Repl's container. Note that this connection persists throughout the entire duration of the session.","_key":"c051fbbe1d5f2"}],"markDefs":[{"_key":"5f08bfedb36b","_type":"link","href":"https://en.wikipedia.org/wiki/WebSocket"}],"_type":"block","style":"normal"},{"_key":"0f9e0dc59c32","children":[{"_type":"span","marks":[],"text":"Turns out that while GCP's load balancer works well for request-response style applications, it didn't work great for applications relying on long-lived WebSocket connections. One key issue with the geographic distribution approach we initially chose had to do with the ","_key":"0f9e0dc59c320"},{"_type":"span","marks":["em"],"text":"spillover","_key":"0f9e0dc59c321"},{"_type":"span","marks":[],"text":" feature of the load balancer. Spillover is when a certain region's backend is out of capacity so GCP's load-balancer diverts traffic to another backend in a different region. This meant that users could end up with severely suboptimal connections.","_key":"0f9e0dc59c322"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"35e9b9e51dac","children":[{"_type":"span","marks":[],"text":"Another issue came with the way we handle multiplayer interactions. In our architecture, traffic can hop across multiple machines before reaching the machine on which the Repl is actually running. The way we did this at the time relied heavily on the behavior of the default Google Cloud Load Balancer, so this was mostly out of our control. There were cases where traffic hopped from the US to Asia, and back to the US again on almost every interaction. This could be addressed by implementing some sort of regional affinity in our load balancer, but other problems soon surfaced.","_key":"35e9b9e51dac0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2a4f0f00e743","children":[{"_type":"span","marks":[],"text":"All of our databases and brains (Redis, then ","_key":"2a4f0f00e7430"},{"_type":"span","marks":["16796b871037"],"text":"Control Plane","_key":"2a4f0f00e7431"},{"_type":"span","marks":[],"text":") were only in the US. This adds extra latency for managing the global state of the infrastructure, which is definitely something you want to avoid. Another point was that the actual contents of the Repls (for example, text files containing your code) were still stored in the US, so transmitting that halfway across the world took a long time. This meant that startup time was terrible.","_key":"2a4f0f00e7432"}],"markDefs":[{"_key":"16796b871037","_type":"link","href":"https://blog.replit.com/geo-part-1-controlplane"}],"_type":"block","style":"normal"},{"_key":"7116af3af5d5","children":[{"_type":"span","marks":[],"text":"It was clear that we had to review our geographic distribution plan. How can we keep the benefits provided by clusters while adding the possibility of running Repls closer to wherever the user is?","_key":"7116af3af5d50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"fd561215c1c3","children":[{"_type":"span","marks":[],"text":"Clusters Revisited: The Resharded Architecture","_key":"fd561215c1c30"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"421708aea62c","children":[{"_type":"span","marks":[],"text":"Having multiple clusters worked great for separating failure domains and providing a better experience for developers. Due to the fact that most users ended up in the free-tier cluster, however, made it so that we had one cluster that was way too large for its own good. There was also the issue of designating users to individual clusters: having problems in a cluster means that some users won't be able to use Replit at all! It was time to rethink how clusters fit into the architecture.","_key":"421708aea62c0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"02e5309cd78d","children":[{"_type":"span","_key":"02e5309cd78d0","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"3df6db8c3adc","children":[{"_type":"span","marks":[],"text":"Up until this point, in most situations, a user is taken to belong to a specific cluster. What if, instead, we made clusters look the same so that we can distribute Repls uniformly among them? This should result in a situation where the load is more equally distributed, and the overall experience is superior due to the fact that we're working with smaller units. It also opens the possibility of making these small, entirely self-contained units belong to just a single region, instead of being distributed among multiple regions.","_key":"3df6db8c3adc0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"98db35a37a16","children":[{"_type":"span","marks":[],"text":"So we ended up with a new organization, in which each user belongs to a ","_key":"98db35a37a160"},{"_type":"span","marks":["strong"],"text":"geographic region","_key":"98db35a37a161"},{"_type":"span","marks":[],"text":", and each such region has multiple ","_key":"98db35a37a162"},{"_type":"span","marks":["em"],"text":"shards","_key":"98db35a37a163"},{"_type":"span","marks":[],"text":" (to be used interchangeably with ","_key":"98db35a37a164"},{"_type":"span","marks":["em"],"text":"clusters","_key":"98db35a37a165"},{"_type":"span","marks":[],"text":") which have the same behavior and characteristics. The next question is: how to distribute Repls among the different shards in a region?","_key":"98db35a37a166"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a486d45d2050","children":[{"_type":"span","marks":[],"text":"One alternative would be just to pick a random shard for each Repl. This would work but then you can't deterministically say what shard a Repl belongs to. Another alternative would be to take the Repl ID modulo the number of shards and pick a shard based on that. The problem with that approach is that, whenever you add a new shard, you end up with a large number of Repls needing to be moved across different shards. This is not a good property to have, since we want to minimize the costs of adding and removing new shards.","_key":"a486d45d20500"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"10950472ccb5","children":[{"_type":"span","marks":[],"text":"The solution is to use ","_key":"10950472ccb50"},{"_type":"span","marks":["e3e422958d36","strong"],"text":"consistent hashing","_key":"10950472ccb51"},{"_type":"span","marks":[],"text":", which is a general technique that aims to minimize the number of items reassigned to a node whenever the number of nodes changes. It works roughly by distributing nodes (in our case, shards) along a circle, placing items (in our case, Repls) in that circle, then assigning each item to whatever node is closest to it in a clockwise direction. In doing that, whenever we add a new shard to a continent, we minimize the number of Repls that need to be transferred.","_key":"10950472ccb52"}],"markDefs":[{"_key":"e3e422958d36","_type":"link","href":"https://en.wikipedia.org/wiki/Consistent_hashing"}],"_type":"block","style":"normal"},{"_key":"41792821f4e5","children":[{"_type":"span","marks":[],"text":"Having the technical details at hand, we decided that the new India region provided an excellent opportunity to test out the new architecture.","_key":"41792821f4e50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2e8eaac5e5bf","children":[{"_type":"span","marks":[],"text":"Sculpting the Clouds Halfway Across the World","_key":"2e8eaac5e5bf0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"8b2223abc864","children":[{"_type":"span","marks":["5eaa392b3056"],"text":"India accounts for our second largest developer base","_key":"8b2223abc8640"},{"_type":"span","marks":[],"text":". Since all Repls have been running exclusively in the United States, this has caused certain interactions to experience excessive latency for a significant portion of our user base. This can be especially disruptive when working with highly interactive experiences, such as LSP autocompletion and VNC. We decided to dedicate resources to improving the experience for developers in India.","_key":"8b2223abc8641"}],"markDefs":[{"_key":"5eaa392b3056","_type":"link","href":"https://blog.replit.com/India%20Part%202"}],"_type":"block","style":"normal"},{"_key":"dd408e0f3f04","children":[{"_type":"span","marks":[],"text":"At Replit, we create and manage our infrastructure using Terraform. This means that we instantly have automation on many of the critical steps to create all the resources needed for a cluster by moving some code and changing a few parameters. After reworking our code to make it more amenable for reuse (and also enforcing some ","_key":"dd408e0f3f040"},{"_type":"span","marks":["80e066608961"],"text":"best practices","_key":"dd408e0f3f041"},{"_type":"span","marks":[],"text":"), we were able to get two clusters running in the ","_key":"dd408e0f3f042"},{"_type":"span","marks":["code"],"text":"asia-south1","_key":"dd408e0f3f043"},{"_type":"span","marks":[],"text":" region.","_key":"dd408e0f3f044"}],"markDefs":[{"_key":"80e066608961","_type":"link","href":"https://cloud.google.com/docs/terraform/best-practices-for-terraform"}],"_type":"block","style":"normal"},{"_key":"33c3ae593702","children":[{"_type":"span","marks":[],"text":"After the initial round of internal tests, we let users try the new Asia clusters by selecting their continent. When a user selects their continent, we transfer their Repls to the desired continent in the background. After a week we had about 3000 developers in the new clusters, and the results were promising.","_key":"33c3ae5937020"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"74ea264c9a0a","children":[{"_type":"span","marks":[],"text":"The Great User Migration","_key":"74ea264c9a0a0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"db45fdbb7cac","children":[{"_type":"span","marks":[],"text":"Based on analytics data, we estimated that about 20% of our users might benefit from running their Repls in Asia. That's no small amount, especially given the fact that we recently reached ","_key":"db45fdbb7cac0"},{"_type":"span","marks":["5d439d075aff"],"text":"20 million developers","_key":"db45fdbb7cac1"},{"_type":"span","marks":[],"text":", each with many Repls on average. We decided to initially transfer a batch of over 300,000 users from India. This is not just a matter of setting a value in the database and calling it a day - let's go over the details of the migration while taking a brief detour to explain how Repls are transferred across clusters.","_key":"db45fdbb7cac2"}],"markDefs":[{"_key":"5d439d075aff","_type":"link","href":"https://blog.replit.com/20-million-developers"}],"_type":"block","style":"normal"},{"_key":"e92c906cdaf6","children":[{"_type":"span","marks":[],"text":"Cluster Transfers","_key":"e92c906cdaf60"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"878995f648df","children":[{"_type":"span","marks":[],"text":"Since clusters are isolated from each other, we have some source of truth that knows which cluster Repls belong to. This is the job of the cluster-tracking service. This service also plays a large role in our ","_key":"878995f648df0"},{"_type":"span","marks":["9bb6d593003a"],"text":"custom DNS infrastructure","_key":"878995f648df1"},{"_type":"span","marks":[],"text":". A notable point is that this service is a critical piece of our infrastructure - if it goes down, users won't be able to access their Repls. Naturally, the cluster tracker is also responsible for transferring Repls across clusters. This means transferring the Repl's data and assigning it to the correct cluster in the database.","_key":"878995f648df2"}],"markDefs":[{"_key":"9bb6d593003a","_type":"link","href":"https://blog.replit.com/dns"}],"_type":"block","style":"normal"},{"_key":"f7821da26480","children":[{"_type":"span","marks":[],"text":"Now, transferring Repls in large amounts is no trivial task, especially since there's a critical piece of infrastructure sitting in that path, and also because in this case, we have to transfer to data centers halfway across the world. The trick here is to transfer Repls ","_key":"f7821da264800"},{"_type":"span","marks":["em"],"text":"lazily","_key":"f7821da264801"},{"_type":"span","marks":[],"text":". Instead of going through each of the user's Repls and transferring its data to another region upfront, we set a flag in the database that tells Lore to transfer the Repl whenever the user connects to it.","_key":"f7821da264802"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7d4221d7a6bb","children":[{"_type":"span","marks":[],"text":"We went ahead and migrated over 300,000 users to the new Asia clusters by lazy transferring their Repls. Doing the Repl transfers lazily worked wonders to reduce the total amount of work that needed to be done, while also spreading it out to a longer time window. Not only have we avoided doing the unnecessary work of transferring potentially millions of unused Repls, we also did the migration with zero downtime for developers, without incurring too much load on our infrastructure.","_key":"7d4221d7a6bb0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f6b176f59e69","children":[{"_type":"span","marks":[],"text":"Conclusion","_key":"f6b176f59e690"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"fd40a8cfda4d","children":[{"_type":"span","marks":[],"text":"The graph below shows some measurements of interaction latency from the perspective of a user in India. The ","_key":"fd40a8cfda4d0"},{"_type":"span","marks":["code"],"text":"NA","_key":"fd40a8cfda4d1"},{"_type":"span","marks":[],"text":" line shows the latency with the Repl running on our US servers. The ","_key":"fd40a8cfda4d2"},{"_type":"span","marks":["code"],"text":"Asia","_key":"fd40a8cfda4d3"},{"_type":"span","marks":[],"text":" line, on the other hand, shows the latency when hitting our new Asia clusters. The difference is significant: India-US latency was about 300ms on average. When using the ","_key":"fd40a8cfda4d4"},{"_type":"span","marks":["code"],"text":"Asia","_key":"fd40a8cfda4d5"},{"_type":"span","marks":[],"text":" servers, by contrast, the average latency between the user and our servers was just ","_key":"fd40a8cfda4d6"},{"_type":"span","marks":["em"],"text":"19ms","_key":"fd40a8cfda4d7"},{"_type":"span","marks":[],"text":".","_key":"fd40a8cfda4d8"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"134947b3d9cf","children":[{"_type":"span","_key":"134947b3d9cf0","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2948aad26ec4","children":[{"_type":"span","marks":[],"text":"In conclusion, taking a step back and revising the approach we took to clusters made it possible to improve the experience for a large number of developers. You can now pick the location that's closest to you by simply accessing the ","_key":"2948aad26ec40"},{"_type":"span","marks":["code"],"text":"Account","_key":"2948aad26ec41"},{"_type":"span","marks":[],"text":" page and choosing one of the available regions. Geographic distribution is something that we wanted to have for a long time now. None of this would be possible without the prior improvements to our infrastructure. Having powerful and battle-tested primitives allows you to carry out such projects with the confidence that you won't have outages or data corruption.","_key":"2948aad26ec42"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"beb6a803f4ce","children":[{"_type":"span","marks":[],"text":"Happy Repling (with low latency)!","_key":"beb6a803f4ce0"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2023-03-16T16:00:00.000Z"}