{"_id":"post-22ef0117-5a00-4a08-af91-60dd2a148fad","_type":"post","title":"Replit and Hack Club - Tools to Enhance Education","slug":{"_type":"slug","current":"hackclub"},"body":[{"_key":"75e2f1bf7f44","children":[{"_type":"span","_key":"75e2f1bf7f440","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"e914a496fb0a","children":[{"_type":"span","marks":[],"text":"Hello! We’re Arihant Swain and JP Kerrane, co-leads running P2P Hack Club, a high school programming club (👋 from Colorado!), and a local branch of the nonprofit Hack Club.","_key":"e914a496fb0a0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7faf54604d89","children":[{"_type":"span","marks":[],"text":"Hack Club is a super amazing network of high school coding clubs run by high schoolers across the world. Through Hack Club, we've met a lot of friends both at our school, and other hackers at other clubs.","_key":"7faf54604d890"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"218d61a63f67","children":[{"_type":"span","_key":"218d61a63f670","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4a62eb612241","children":[{"_type":"span","marks":[],"text":"Every summer Hack Club does something cool, and last summer we chartered a train from New York to Los Angeles for the world’s longest hackathon across America. I (JP) was lucky enough to participate, and I met amazing best friends, and got to demo my project on the factory floor of SpaceX on day 10 of the trip. I had so many experiences that I will remember for the rest of my life.","_key":"4a62eb6122410"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"eba9d0b984aa","children":[{"_type":"span","marks":[],"text":"Especially after last summer, I wanted to enhance that feeling of togetherness and sense of community between hackers at my own school through our local Hack Club chapter.","_key":"eba9d0b984aa0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"e0f03e0c9db2","children":[{"_type":"span","_key":"e0f03e0c9db20","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"cc03502e70ab","children":[{"_type":"span","marks":[],"text":"Our Hack Club has always been a way for us to express our interest in programming. We plan meetings every week and meet after school to talk about ways to promote, engage, and do more with our club. We’ve gradually been building our local community, hosting game nights on our very own Discord, built games and showcased them off to the school, and competed against each other in website building competitions. The core of all of this is our hour-long after-school meetings.","_key":"cc03502e70ab0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a03c7a05ac71","children":[{"_type":"span","marks":[],"text":"We’ve used Replit in our club to help run programming workshops and keep a consistent programming experience for all our hackers regardless of what they're coding on.","_key":"a03c7a05ac710"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"bf4173a1182b","children":[{"_type":"span","marks":[],"text":"Our first meeting every school year is always introducing beginners to create their first websites in HTML and CSS. This is extremely easy with Replit since we barely need to set anything up. When it’s time to demo projects, everyone can instantly publish their website online! Being able to tell people that they could build and publish a website in less than 15 minutes is super amazing. Our hackers love that our meetings are a low-stress environment to just create cool stuff. We try to structure our workshops with a 15 minute or less publish time so that everyone can spend the majority of the meeting tinkering around with their project and adding their own features.","_key":"bf4173a1182b0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a818911faadf","children":[{"_type":"span","marks":[],"text":"Later in the year, as hackers venture into creating more complex projects with JavaScript and Python, hackers pair-program, and work on projects collaboratively. It’s definitely a highlight of the meeting to see people talking to each other while they are debugging and working on projects together. When the COVID-19 pandemic hit, our club was forced into a virtual format overnight. This made pair-programming harder, but not impossible. With replit, everything worked almost the same as it did when we were teaching in person; hackers were still able to collaborate together.","_key":"a818911faadf0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8509a0f75fea","children":[{"_type":"span","_key":"8509a0f75fea0","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"43a1e2033ce5","children":[{"_type":"span","marks":[],"text":"In the 2021-22 school year, we’ve luckily gone back to in-person learning. This year, we want to use Replit's GitHub integration to teach people how to contribute to open source projects through the yearly Hacktoberfest event. Our club website will be completely built by hackers in our club, providing a cool opportunity to teach about open source and allow hackers to showcase their flair as we continue to build our community.","_key":"43a1e2033ce50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f1babfb29a11","children":[{"_type":"span","marks":[],"text":"After two years of using Replit to help teach programming in our club, it's definitely shown itself to be versatile enough for all of the bumps in the road we've experienced. This year, we're looking forward to running an even better club. Happy hacking!","_key":"f1babfb29a110"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2021-12-15T15:57:49.915Z"}