{"_id":"post-9cc11cde-dcea-48f2-b807-55a4ddfe0413","_type":"post","title":"Markdown Preview","slug":{"_type":"slug","current":"markdown-preview"},"body":[{"_key":"741f9ec71eb8","children":[{"_type":"span","marks":[],"text":"It's always been super fast to start writing markdown in a repl. However, the more we used it, the more we realized there were some key features we were missing that would make our lives easier. Which is why we're excited to announce all of the new improvements we've made to the markdown editing experience on Replit!","_key":"741f9ec71eb80"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"77f1ab297940","children":[{"_type":"span","marks":[],"text":"Now, if you open up a markdown file (a file with a ","_key":"77f1ab2979400"},{"_type":"span","marks":["code"],"text":".md","_key":"77f1ab2979401"},{"_type":"span","marks":[],"text":" extension), you'll notice that a new tab appears to the right of your editor with the file's contents. This allows you to see a live preview of the rendered markdown right as you type it! You can also toggle the preview off if you no longer wish to see it. The file that's being previewed will persist in the markdown tab until you open another markdown file or toggle it off explicitly. This has the added benefit of being able to see instructions or notes, like the repl's README, alongside your code.","_key":"77f1ab2979402"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"614c2a45a3bf","children":[{"_type":"span","marks":[],"text":"You'll also notice in larger documents that the preview window stays synced with your current position in the file. As you type or move your cursor in the editor, the markdown pane will scroll with you, consistently keeping your cursor in the center of view.","_key":"614c2a45a3bf0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"ad732ae3fc6d","children":[{"_type":"span","marks":[],"text":"Lastly, we've added the ability to render local images that you reference in your markdown file directly in the preview pane!","_key":"ad732ae3fc6d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"20537938c7f2","children":[{"_type":"span","marks":[],"text":"We make use of these features every day internally. In addition to writing bots and helpful scripts on Replit, we also use it to host our company handbook, this blog, as well as all of our meeting notes and design docs. It's been incredibly useful for us to be able to keep our notes in the same place as our code, all hosted, synced, and easily shareable. It also has added benefits like being able to write and execute a bash script, ","_key":"20537938c7f20"},{"_type":"span","marks":["code"],"text":"new.sh","_key":"20537938c7f21"},{"_type":"span","marks":[],"text":", that generates a new markdown file based on an existing template. Plus it allows you to type using Vim (or Emacs) key bindings out of the box! These updates, in addition to all of our new collaborative features like ","_key":"20537938c7f22"},{"_type":"span","marks":["ccb68561f72a"],"text":"threads","_key":"20537938c7f23"},{"_type":"span","marks":[],"text":", have enabled us to move off of Google Docs entirely.","_key":"20537938c7f24"}],"markDefs":[{"_key":"ccb68561f72a","_type":"link","href":"https://blog.replit.com/threads"}],"_type":"block","style":"normal"},{"_key":"32fe7edccefb","children":[{"_type":"span","marks":[],"text":"We find these new improvements incredibly useful and hope you do too. Over time, we think more and more teams will prefer to write markdown in Replit because once you've started using it, it's hard to go back. Gone are the days where you have to open a pull request to fix that typo you noticed in the README. Instead, you can just fix it.","_key":"32fe7edccefb0"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2021-03-11T05:00:00.000Z"}