{"_id":"post-f6abaa54-36af-491d-b31e-cbf94847078b","_type":"post","title":"May 18 Replit downtime","slug":{"_type":"slug","current":"may-18-replit-downtime"},"body":[{"_key":"8e117147be07","children":[{"_type":"span","marks":[],"text":"Yesterday, we had a period of about 2h from 11:45 to 13:56 (Pacific Time) in which all users were unable to access their Repls through the site. We have addressed the root cause, and the system is now operating normally. We know a two-hour downtime is not acceptable for you or your users. This post summarizes what happened and what we're doing to improve Replit so that this does not happen again.","_key":"8e117147be070"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8737847b1dd5","children":[{"_type":"span","marks":[],"text":"Technical details","_key":"8737847b1dd50"}],"markDefs":[],"_type":"block","style":"h1"},{"_key":"2273bcc6eed5","children":[{"_type":"span","marks":[],"text":"Here is the timeline of what happened, all times in Pacific Time:","_key":"2273bcc6eed50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d15c718c1f83","children":[{"_type":"span","marks":[],"text":"In 2021, we changed the way that configuration is pushed to the VMs that run Repls and streamlined multiple kinds of configurations. During this migration, a latent bug that we had not hit was introduced. When we tried to see if a configuration kind had been updated, we acquired a ","_key":"d15c718c1f830"},{"_type":"span","marks":["f794dc04318e"],"text":"Golang RwMutex","_key":"d15c718c1f831"},{"_type":"span","marks":[],"text":" for reading, but if there was not a handler for that configuration kind, the read-lock would not be released.","_key":"d15c718c1f832"}],"markDefs":[{"_key":"f794dc04318e","_type":"link","href":"https://pkg.go.dev/sync#RWMutex"}],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"631dba23497a","children":[{"_type":"span","marks":[],"text":"Golang's RwMutex are write-preferring, so acquiring multiple read-locks is allowed as long as there are no goroutines attempting to acquire a write-lock. When that happens, it will cause any future read-locks to block.","_key":"631dba23497a0"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"039e3ebbb19e","children":[{"_type":"span","marks":[],"text":"On May 16, 2023,we introduced a new configuration kind, but we did not add a handler, which means that from this point on we were leaking read-locks, but the system was able to make progress.","_key":"039e3ebbb19e0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"9bcceb444c37","children":[{"_type":"span","marks":[],"text":"10:28 on May 18, a regular build went out to production. This had a configuration change to the service that runs Repls.","_key":"9bcceb444c370"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"13d79902b02a","children":[{"_type":"span","marks":[],"text":"11:45, the CD pipeline pushed the configuration change to all clusters simultaneously and was the first time that the write-lock was attempted to be acquired. At this point all VMs triggered the deadlock within minutes of each other. This caused all VMs to report being unhealthy and our internal load-balancer to not be able to send traffic to any VM. During normal operation, a machine not being able to launch containers would mark itself as not-alive so that the autoscaler could recreate that VM. But this deadlock caused the ","_key":"13d79902b02a0"},{"_type":"span","marks":["aff370501a00"],"text":"liveness probe","_key":"13d79902b02a1"},{"_type":"span","marks":[],"text":" to fail-open, so all VMs were being left alone but not being able to serve traffic.","_key":"13d79902b02a2"}],"markDefs":[{"_key":"aff370501a00","_type":"link","href":"https://cloud.google.com/load-balancing/docs/health-checks"}],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"fa2998eb6a5f","children":[{"_type":"span","marks":[],"text":"11:55, we started getting pages for widespread failures. A build started rolling out to production an hour or so ago, so we quickly suspected that the build was bad. The standard procedure during an incident ","_key":"fa2998eb6a5f0"},{"_type":"span","marks":["165fb3244dd7"],"text":"is to roll back first, ask questions later","_key":"fa2998eb6a5f1"},{"_type":"span","marks":[],"text":" and increase capacity in the system to accommodate for the extra load. Unfortunately the rollback process didn't go as smoothly, and it took us two tries and 40 minutes to push the last-known good build back to production. Then, when the rollback process finished, it had reset all the extra capacity we had given the system to its previous size.","_key":"fa2998eb6a5f2"}],"markDefs":[{"_key":"165fb3244dd7","_type":"link","href":"https://outage.party/"}],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"0608de9de960","children":[{"_type":"span","marks":[],"text":"By this point, the vast majority of the VMs were idling doing nothing, and the few VMs that were able to serve traffic were getting too many requests too quickly and started getting swamped and reporting unhealthy for the purposes of load-balancing. The auto-scaler was configured only to look at metrics related to the load caused by running Repls, but it was missing a signal to look at the number of incoming requests. Since the extra capacity we had added was reset, this caused the auto-scaler to start making all the VM Managed Instance Groups smaller and smaller, because on average the utilization of the system was pretty low.","_key":"0608de9de9600"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"a7a0aa7f2827","children":[{"_type":"span","marks":[],"text":"12:42, enough capacity with the correct build had been brought online, the system had started slowly recovering, and some users were able to get access to their Repls. But the recovery wasn't progressing fast enough. We were prioritizing getting rid of the VMs that were running the old build so that most of the capacity was in the new build, but the sizes of the Instance Groups were already too low to recover at a desirable rate, and the auto-scaler was still getting mixed signals which caused the instance groups to not be able to grow to the correct size.","_key":"a7a0aa7f28270"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"161813a62b55","children":[{"_type":"span","marks":[],"text":"13:17, we shipped a change to make retries less aggressive, which reduced a bit of load.","_key":"161813a62b550"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"7aec24a03daf","children":[{"_type":"span","marks":[],"text":"13:28, we scaled up all instance groups once more to accommodate for the extra load. This was when everything started recovering in earnest.","_key":"7aec24a03daf0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"7cede995b441","children":[{"_type":"span","marks":[],"text":"13:56, the last alert stopped, and the system had fully recovered. At this point, we started looking to find the root cause of the issue to avoid making changes that would trigger it again.","_key":"7cede995b4410"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"b6c9e3b6900e","children":[{"_type":"span","marks":[],"text":"16:15 the root cause was discovered by dumping the goroutines of a VM that hadn't yet been removed by the autoscaler from the rollout.","_key":"b6c9e3b6900e0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"23fd3c997eae","children":[{"_type":"span","marks":[],"text":"19:39 a new build with a bugfix for the deadlock was pushed to production, so that we no longer hit this one issue.","_key":"23fd3c997eae0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"bdd6ac180c97","children":[{"_type":"span","marks":[],"text":"What are the next steps for Replit?","_key":"bdd6ac180c970"}],"markDefs":[],"_type":"block","style":"h1"},{"_key":"4cf39da088c2","children":[{"_type":"span","marks":[],"text":"The bug that triggered the incident has been fixed, but per our blameless postmortem culture we're more interested in making changes so that we don't run into the same or similar issues in the future, and we don't take as much time to resolve going forward. To do so, we are taking several actions:","_key":"4cf39da088c20"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"e53ca8c1871c","children":[{"_type":"span","marks":[],"text":"We're changing our CD system so that rollbacks to good-known-states are fast, reliable, and robust against operator errors and make the systems not express conflicting intents, and ensure that the necessary capacity for quick recovery is available.","_key":"e53ca8c1871c0"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"39e5382f2772","children":[{"_type":"span","marks":[],"text":"Longer-term we are also considering investing in an intent-based CD to make this process even more reliable.","_key":"39e5382f27720"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"efd25b6d712c","children":[{"_type":"span","marks":[],"text":"We're also going to do regular Disaster and Recovery Training exercises to ensure that rollbacks are still working when we need them to.","_key":"efd25b6d712c0"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"710388f0d470","children":[{"_type":"span","marks":[],"text":"We're making configuration changes no longer hit production simultaneously: they will be staggered by cluster and with a longer jitter to reduce the blast radius.","_key":"710388f0d4700"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"6d8d5f7ea8c7","children":[{"_type":"span","marks":[],"text":"We are revamping the logic that handles healthiness and liveness so that catastrophic failures can recover on their own.","_key":"6d8d5f7ea8c70"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"11a5fae53d62","children":[{"_type":"span","marks":[],"text":"We're also investing in more static analysis to prevent whole families of correctness issues from making it to production.","_key":"11a5fae53d620"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"}],"publishedAt":"2023-05-20T00:30:00.000Z"}