{"_id":"post-5b9cd7cf-5d6a-4121-9834-5394a6b9b760","_type":"post","title":"Replit Builders Series - NodePad: From Idea to MVP with Replit Deployments","slug":{"_type":"slug","current":"nodepad"},"body":[{"_key":"cc57f5b8667f","children":[{"_type":"span","marks":["em"],"text":"Replit is where builders come to bring their software and app ideas to life, fast. We’re showcasing builders and software they created and deployed on Replit.","_key":"cc57f5b8667f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"01d15ee8a758","children":[{"_type":"span","marks":[],"text":"\n","_key":"01d15ee8a7580"},{"_type":"span","marks":["64e177687db9"],"text":"Learn more about Deployments","_key":"01d15ee8a7581"},{"_type":"span","marks":[],"text":"\n","_key":"01d15ee8a7582"}],"markDefs":[{"_key":"64e177687db9","_type":"link","href":"https://replit.com/site/deployments"}],"_type":"block","style":"normal"},{"_key":"2e6ad970ac3a","children":[{"_type":"span","marks":[],"text":"NodePad is a platform for idea exploration driven by AI. NodePad founder Saleh Kayyali went from designer to consumer app founder. The app he built and deployed end to end on Replit has thousands of users and slick UI. It shot to #5 on HackerNews, and yet he’s never been paid to develop software before. How?","_key":"2e6ad970ac3a0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c0533d4b0d86","children":[{"_type":"span","marks":[],"text":"Saleh is an interaction designer and the founder of NodePad. He used Replit to build, deploy, and host NodePad on reliable infrastructure in a few clicks. The idea that Saleh made real? A canvas-style app for ideating and brainstorming with LLMs.","_key":"c0533d4b0d860"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a06c9ac9ef1b","children":[{"_type":"span","marks":[],"text":"Meet Saleh Kayyali:","_key":"a06c9ac9ef1b0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"0a2c8e624f37","children":[{"_type":"span","marks":[],"text":"Saleh is an accomplished interaction designer, creative technologist, and tinkerer based in London. With a multidisciplinary background in design, startup consultancy, and content production, Saleh constantly seeks new avenues to channel his creativity. He builds concepts, games, even perfume. Loves writing and storytelling. AI caught Saleh’s imagination.","_key":"0a2c8e624f370"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"20f130cef0ae","children":[{"_type":"span","marks":[],"text":"About NodePad:","_key":"20f130cef0ae0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"108cc29e3bf1","children":[{"_type":"span","marks":[],"text":"NodePad started as a quick experiment last December. Originally named ThoughtPad, it began as a Repl (a software app on Replit) with a linked domain. As an interaction designer who knew how to code, Saleh wanted more control than no-code offerings provide. He wanted a real development environment, fast. With Replit, Saleh found the perfect platform to unleash his creative potential and take his designs beyond static mockups. Closer to reality.","_key":"108cc29e3bf10"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4d7516dc6707","children":[{"_type":"span","marks":[],"text":"Saleh wanted to build a platform for collaboration with AI, but knew NodePad had to be different. Saleh envisioned an interaction that diverged from traditional chat interfaces, which often led to lengthy conversations or misleading outputs. By limiting the use of LLMs (large language models) and focusing on a canvas environment, NodePad offers users a unique space to visually organize their ideas, connect related nodes, and generate new insights with the support of AI.","_key":"4d7516dc67070"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d6edfd1acb62","children":[{"_type":"span","marks":[],"text":"Deploying NodePad through Replit made it real, allowing Saleh to share his creation with the world. In the video demo below, Saleh discusses in detail his design process for building Nodepad as well as outlining features like visual organization, AI brainstorming, and exporting a text file of a Nodepad canvas.","_key":"d6edfd1acb620"}],"markDefs":[],"_type":"block","style":"normal"},{"_type":"embed","_id":"2987a19e-1d82-47e3-91cd-2edce9b1a91c","url":"https://www.youtube.com/embed/eYRdF8RvhlQ","_key":"aa17749badc0"},{"_key":"6f70732294ee","children":[{"_type":"span","marks":[],"text":"The Power of Replit Deployments:","_key":"6f70732294ee0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"b4c06f376447","children":[{"_type":"span","marks":[],"text":"When Saleh discovered Replit Deployments, NodePad transformed rapidly. As an interaction designer, he saw Replit more and more as a design tool to build real, functional products.The ability to build and design directly on Replit without spending days setting up a local dev environment empowered Saleh to bring his ideas to life effortlessly.","_key":"b4c06f3764470"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"128675d7d7a0","children":[{"_type":"span","marks":[],"text":"Replit Deployments eliminated the need for him to handle infrastructure and provided him a platform to showcase his designs in action. He no longer needed to rely solely on examples and false demos. With NodePad running on a custom link, Saleh could actively engage his audience and let them interact with his creation firsthand.","_key":"128675d7d7a00"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8c800418162b","children":[{"_type":"span","marks":[],"text":"Future Possibilities and Growth for Nodepad:","_key":"8c800418162b0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"6d81457e7d5b","children":[{"_type":"span","marks":[],"text":"NodePad is an ongoing experiment for Saleh. He continually explores new avenues to enhance its functionality and make it more accessible. One of the challenges he is tackling is the inclusion of decision trees, enabling users to navigate their ideas through defined levels. This presents a significant challenge as it instantly fills the canvas with a plethora of information. He is also exploring the integration of pre-baked prompts libraries, and addressing moderation concerns that often come with AI tools. Saleh envisions NodePad as a passion project that sits between academic research and a startup, allowing it to grow organically while maintaining its experimental nature.","_key":"6d81457e7d5b0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"120a2e2efede","children":[{"_type":"span","marks":[],"text":"NodePad's story exemplifies the spirit of innovation and creativity that Replit fosters. By providing a platform that empowers developers like Saleh Kayyali to build and prototype their ideas effortlessly, Replit enables a new breed of creators.","_key":"120a2e2efede0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"01fcb32155bf","children":[{"_type":"span","marks":[],"text":"To learn more about Saleh Kayyali and his projects, visit his ","_key":"01fcb32155bf0"},{"_type":"span","marks":["d88e93aa41c9"],"text":"personal website","_key":"01fcb32155bf1"},{"_type":"span","marks":[],"text":" or follow ","_key":"01fcb32155bf2"},{"_type":"span","marks":["29fb706f20a5"],"text":"him","_key":"01fcb32155bf3"},{"_type":"span","marks":[],"text":" on Twitter.","_key":"01fcb32155bf4"}],"markDefs":[{"_key":"d88e93aa41c9","_type":"link","href":"https://www.mskayyali.me/"},{"_key":"29fb706f20a5","_type":"link","href":"http://twitter.com/mskayyali"}],"_type":"block","style":"normal"}],"publishedAt":"2023-06-01T00:00:00.000Z"}