{"_id":"post-90dab389-bc7c-403d-a7f2-6f41c149377f","_type":"post","title":"Ode to Educators","slug":{"_type":"slug","current":"ode-to-educators"},"body":[{"_key":"1f8834eb415d","children":[{"_type":"span","marks":[],"text":"\"Why am I here? I don't even like computer science\", Raul lingered by the door, his body language showing his discomfort. \"This is a mistake. I'm not supposed to be here\". Now fully within the classroom, Raul alternated between pacing in circles and eyeing the last few good seats left in our quickly filling classroom. Several minutes passed, and my students used the last remaining minutes of their passing period to trade stories from their summer and muse about the overwhelming sensation of the coming year. They were 11th graders now, after all; this was \"the most important year to appeal to colleges.\"","_key":"1f8834eb415d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d40acc3e4ec1","children":[{"_type":"span","marks":[],"text":"I stood to gather their attention, and they became silent as their eyes stared up at me. We were sitting in our community circle, ready to begin. Raul transitioned from pacing to standing apprehensively behind a seat, not entirely convinced that sitting would help his situation. He was new to our small school community. The other students had mostly been a cohesive group since the 6th grade. A new 11th grader is uncommon, further adding to his angst.","_key":"d40acc3e4ec10"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"94d02407f0d4","children":[{"_type":"span","marks":[],"text":"\"Welcome to our school, Raul. We're glad to have you here. Would you like to introduce yourself?\".","_key":"94d02407f0d40"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"db17b714eb5f","children":[{"_type":"span","marks":[],"text":"\"Yeah. I'm Raul. I'm from the deep east, and I'm not supposed to be here.\" A few students chuckled as others stared expressionlessly.","_key":"db17b714eb5f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"b29343b4d16d","children":[{"_type":"span","marks":[],"text":"\"Sure you are! The principal says this is just the sort of class for you\". I relished the opportunity to express my unconcerned charm. \"Computer Science is for everybody. I'm sure we'll have a great time this year\". I gently motioned for him to sit as I took my own seat.","_key":"b29343b4d16d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d35583956e23","children":[{"_type":"span","marks":[],"text":"Raul plopped down indignantly: \"Nuh-uh, not me. I did Code-dot-org. I did the turtle. I did the apps.\"","_key":"d35583956e230"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"10a767b5470d","children":[{"_type":"span","marks":[],"text":"\"We'll see about that,\" I retorted in a calm, reassuring manner.","_key":"10a767b5470d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"ef1ecb76ed6c","children":[{"_type":"span","marks":[],"text":"3 weeks later, Raul had mastered Linux terminal commands and began leading a class discussion on what \"makes a problem generalizable,\" impressing his peers with math tricks he had learned at his previous school. He wrapped up his impromptu peer tutoring and bemused to no one in particular: \"Wow, I feel smart. I never feel smart\". He likely didn't know the people around him had heard this utterance. I did, and I will never forget it.","_key":"ef1ecb76ed6c0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8bc5d35e3587","children":[{"_type":"span","marks":[],"text":"Raul had a challenging year; between family, work, and studies, he was stretched so thin that a lot of his work ended up rushed and sloppy. And yet, he persisted. Raul pushed through his senior year and graduated as the first in his family to go to college. He was awarded a full-ride scholarship to the University of California, Davis. The following year, I had the privilege of teaching his younger brother, just as rambunctious and charming - headed for a bright future of his own making.","_key":"8bc5d35e35870"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c5694451ea77","children":[{"_type":"span","marks":[],"text":"Coding is fun. It's a creative, cerebral process. But I don't teach because I love to code. I teach because I love my students. Sharing my passion with them is how I can serve them best. Every new student who comes through my door is an equal part genius and knucklehead. It's my job to give them tools to see the best in themselves and prove that they are capable of shaping their lives. I do that through building - through giving students the gift of craft and an appreciation for their ability to make for others.","_key":"c5694451ea770"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"bb018ebf6774","children":[{"_type":"span","marks":[],"text":"Learning Computer Science profoundly shaped the lives of Raul, Paula, Marco, Anette, Jessie, Eduardo, and the many others I've had the pleasure of serving. Their stories invigorate me and lift my gaze ever higher toward the horizon. It's all about the kids; it always has been and always will be.","_key":"bb018ebf67740"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f4ea3d5a0111","children":[{"_type":"span","marks":[],"text":"To my friends who teach:","_key":"f4ea3d5a01110"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"59f35e07136c","children":[{"_type":"span","marks":[],"text":"Every student deserves the opportunity to be engaged fully and have a transformative experience. An experience that makes them feel smart and in control of their future. Our teachers are talented and more dedicated than ever. Their passions make an impact every day on the pupils who look up to them.","_key":"59f35e07136c0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8fe5a8195ad5","children":[{"_type":"span","marks":[],"text":"In 2021, I have transitioned my career to focus on a new group of students: Computer Science teachers. For our brave teachers to make Computer Science education a reality for everyone, we'll need better tools, better training, and a better curriculum. This dream is far from reality, and it's going to take enormous effort to make it so.","_key":"8fe5a8195ad50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"a62e43f605fe","children":[{"_type":"span","marks":[],"text":"If you are inspired to lead the charge for a better tomorrow, ","_key":"a62e43f605fe0"},{"_type":"span","marks":["46a175beef8d"],"text":"join the team and me at Repl.it","_key":"a62e43f605fe1"},{"_type":"span","marks":[],"text":". We're making a difference in the lives of learners around the world.","_key":"a62e43f605fe2"}],"markDefs":[{"_key":"46a175beef8d","_type":"link","href":"https://repl.it/site/careers"}],"_type":"block","style":"normal"},{"_key":"eb3ca82c3e07","children":[{"_type":"span","marks":[],"text":"Derrick McMillen is the team lead for Repl.it Teams; former Salesforce and Facebook engineer; former Oakland Unified high school teacher and proud Laney College Computer Science instructor.","_key":"eb3ca82c3e070"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"10ad72b2ec9f","children":[{"_type":"span","marks":["99cabfcdd554"],"text":"derrick@repl.it","_key":"10ad72b2ec9f0"}],"markDefs":[{"_key":"99cabfcdd554","_type":"link","href":"mailto:derrick@repl.it"}],"_type":"block","style":"normal"},{"_key":"46d79855c967","children":[{"_type":"span","marks":["d1b27fc62222"],"text":"@demc_la","_key":"46d79855c9670"}],"markDefs":[{"_key":"d1b27fc62222","_type":"link","href":"https://twitter.com/demc_la"}],"_type":"block","style":"normal"}],"publishedAt":"2021-01-28T00:00:00.000Z"}