{"_id":"post-d60970cf-8950-4a64-a123-07a81d1c75a6","_type":"post","title":"Don't Let Your Development Environment Rot","slug":{"_type":"slug","current":"rot"},"body":[{"_key":"2fdabfb6c788","children":[{"_type":"span","marks":[],"text":"Most systems -- both natural and artificial -- decay, rot, and eventually die. Software is no different. A lot has been written about fighting ","_key":"2fdabfb6c7880"},{"_type":"span","marks":["a22e8543891a"],"text":"\"software rot\"","_key":"2fdabfb6c7881"},{"_type":"span","marks":[],"text":" but there's another type of rot related to software that's not talked about much -- the development environment rot.","_key":"2fdabfb6c7882"}],"markDefs":[{"_key":"a22e8543891a","_type":"link","href":"https://en.wikipedia.org/wiki/Software_rot"}],"_type":"block","style":"normal"},{"_key":"9ef509000981","children":[{"_type":"span","marks":[],"text":"When starting a new project, you make decisions like what language to use, and which platform/runtime to run on, all of which dictates what your development environment will look like. Then you'll also make explicit choices for the development environment, like how will it run on in development mode, will it run in a Virtual Machine? Maybe on containers? How will the environment be bootstrapped? Also, what does the developer work-flow look like? What test framework and runner to use? How do you package your software? etc., etc.","_key":"9ef5090009810"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"502025b5dcd3","children":[{"_type":"span","marks":[],"text":"As you develop your software and the months and years go by, slowly but surely, you'll add more components to your system, you'll have a lot more code to test, and the overall complexity of the system increases. Now, we know that if you want to fight code complexity, you refactor your code, but how do you detect and what do you do about development environment complexity?","_key":"502025b5dcd30"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"0590f7360d74","children":[{"_type":"span","marks":[],"text":"What makes this a tricky question to answer is that the pain is not so apparent to existing developers. Like in the ","_key":"0590f7360d740"},{"_type":"span","marks":["a8e4ed772b0b"],"text":"boiling frog fable","_key":"0590f7360d741"},{"_type":"span","marks":[],"text":", the frog doesn't notice the temperature increase until it's too late. Similarly, developers don't see the complexity creep until it's far too complicated that it requires you to stop making progress on your product to stop and fix the development environment rot.","_key":"0590f7360d742"}],"markDefs":[{"_key":"a8e4ed772b0b","_type":"link","href":"https://en.wikipedia.org/wiki/Boiling_frog"}],"_type":"block","style":"normal"},{"_key":"9e5ebb97f52a","children":[{"_type":"span","marks":[],"text":"So how do we keep the development environment rot in check? A few ways:","_key":"9e5ebb97f52a0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"40c3f086c9ed","children":[{"_type":"span","marks":[],"text":"Keep an eye on the developer on-boarding experience","_key":"40c3f086c9ed0"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"6f82b88225b0","children":[{"_type":"span","marks":[],"text":"If you're growing your team and you have a costly on-boarding experience that spans hours to days before the developer can get the project running locally, then depending on how much you're growing, this will be costly to both the new developer and existing developers that have to help them navigate the complexity.","_key":"6f82b88225b00"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c120374c5f35","children":[{"_type":"span","marks":[],"text":"I remember when I joined Yahoo! back in 2011, it took me days before I could contribute anything meaningful. It was boring and felt like I was burdensome on my colleagues for constantly asking for help. Conversely, when I joined Facebook I was able to get a patch in on my first day! Facebook had an internal Web IDE (kind of like Repl.it) that was pre-setup so you can start coding right away.","_key":"c120374c5f350"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"67ba578c0a11","children":[{"_type":"span","marks":[],"text":"Even if you're not growing your team, I find that the new developer experience is a good proxy for the complexity and overall health of your development environment. So pay close attention to that, and keep it under an hour if possible.","_key":"67ba578c0a110"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"2a1ee1a453bc","children":[{"_type":"span","marks":[],"text":"The Repl.it development environment leverages containers so we can add a new employee or contractor in 15 minutes!","_key":"2a1ee1a453bc0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"14e66d3bc986","children":[{"_type":"span","marks":[],"text":"Keep close tabs on your end-to-end development work-flow","_key":"14e66d3bc9860"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"00029ba9f555","children":[{"_type":"span","marks":[],"text":"Imagine that you have a straightforward change to make to the code-base, say fixing a typo. What's the end-to-end work-flow look like?","_key":"00029ba9f5550"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"fa8f32801ce5","children":[{"_type":"span","marks":[],"text":"Measure how long it takes for a developer to check out a new branch, code their change, run the tests locally, submit a patch, run the continuous integration (CI) tests, and finally merge it into the master branch. In my opinion, you'd want to have this be under 10 minutes.","_key":"fa8f32801ce50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"8ad3eaa9c890","children":[{"_type":"span","marks":[],"text":"Most likely, the most time-consuming thing here will be the CI tests. But there are ways to make CI run faster. For example, make sure your tests run in parallel and that you're only running tests related to the current patch.","_key":"8ad3eaa9c8900"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"581a20d8a8b0","children":[{"_type":"span","marks":[],"text":"A culture of automation","_key":"581a20d8a8b00"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"69236332933c","children":[{"_type":"span","marks":[],"text":"Building an engineering culture that pays close attention to productivity is a tricky thing to do. You can screw up and find yourself in a place where more time is lost trying to automate tasks than making progress on your product or business.","_key":"69236332933c0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"451bccb507a8","children":[{"_type":"span","marks":[],"text":"However, if you do it right, this can be a boon to your productivity. At Repl.it we're a small team, and we're taking on an ambitious mission to make programming more accessible (if we're successful this blogpost will be obsolete) so we care a lot about striking the right balance on automation.","_key":"451bccb507a80"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"965e51b81dd1","children":[{"_type":"span","marks":[],"text":"To make sure you're not automating the wrong things, make sure to let it hurt first. Only do it when something is causing a lot of bugs or it's so obviously painful for developers to work with.","_key":"965e51b81dd10"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"4d80d6275b29","children":[{"_type":"span","marks":[],"text":"Conclusion","_key":"4d80d6275b290"}],"markDefs":[],"_type":"block","style":"h2"},{"_key":"02cf02b978b2","children":[{"_type":"span","marks":[],"text":"This post talked about development environment rot from a team's perspective. But there's a different kind of development environment rot that happens in the developer's personal toolchain that will cause you to slowly be less productive. I hope to talk about this in future posts.","_key":"02cf02b978b20"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"9d036b62fca7","children":[{"_type":"span","marks":[],"text":"At Repl.it, we're imagining a world where this kind of accidental complexity disappears altogether. Read our ","_key":"9d036b62fca70"},{"_type":"span","marks":["c42851546161"],"text":"post","_key":"9d036b62fca71"},{"_type":"span","marks":[],"text":" on how we're approaching this.","_key":"9d036b62fca72"}],"markDefs":[{"_key":"c42851546161","_type":"link","href":"platform"}],"_type":"block","style":"normal"},{"_key":"a276407a3d31","children":[{"_type":"span","marks":[],"text":"Consider following us on ","_key":"a276407a3d310"},{"_type":"span","marks":["2f928f9f036c"],"text":"twitter","_key":"a276407a3d311"},{"_type":"span","marks":[],"text":" :)","_key":"a276407a3d312"}],"markDefs":[{"_key":"2f928f9f036c","_type":"link","href":"https://twitter.com/replit"}],"_type":"block","style":"normal"}],"publishedAt":"2018-06-04T07:00:00.000Z"}