{"_id":"post-3e7a6f45-66be-4401-bd14-d31afe2c4c73","_type":"post","title":"Announcing Secrets Management","slug":{"_type":"slug","current":"secrets"},"body":[{"_key":"1a64a3ac656e","children":[{"_type":"span","marks":[],"text":"Replit is the go-to place for a lot of people to build their applications. People build chatbots, web applications, games, and so much more. Naturally, projects like this need to maintain sensitive information (secrets). Today we're announcing a new and improved way to manage secrets.","_key":"1a64a3ac656e0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"67da2c5e49b5","children":[{"_type":"span","marks":[],"text":"To give you an idea of how and when this is useful, let me give you some examples. To ","_key":"67da2c5e49b50"},{"_type":"span","marks":["974b4a500f55"],"text":"build a Discord chatbot","_key":"67da2c5e49b51"},{"_type":"span","marks":[],"text":", the programmer would have acquired a Discord API key. If the key is exposed, then anyone can come along and send messages as the bot. Before we gave a database for every repl, applications would use an external database with access credentials stored somewhere in the code. Exposing the database connection credentials is disastrous for obvious reasons. When someone builds a web application with authentication (users), the server signs cookies with a cryptographic key, ensuring that the visitors are who they say they are. Stay tuned for an announcement for a Replit authentication system, so you don't have to worry about signing cookies either.","_key":"67da2c5e49b52"}],"markDefs":[{"_key":"974b4a500f55","_type":"link","href":"https://www.codementor.io/@garethdwyer/building-a-discord-bot-with-python-and-repl-it-miblcwejz"}],"_type":"block","style":"normal"},{"_key":"f59c582175d6","children":[{"_type":"span","marks":[],"text":"Traditionally, people purchased ","_key":"f59c582175d60"},{"_type":"span","marks":["9048c016bc25"],"text":"the hacker plan","_key":"f59c582175d61"},{"_type":"span","marks":[],"text":" to make their repls private and keep their secrets secure. However, that meant hiding the repl and the code from the world. People wanted to also ","_key":"f59c582175d62"},{"_type":"span","marks":["b24918bd3e62"],"text":"share their repls with the community","_key":"f59c582175d63"},{"_type":"span","marks":[],"text":". Code sharing allows our community members to get feedback, teach each other, gain customer trust, and get all the goodness that comes with open source. For this reason, in 2019, we introduced the first iteration of the secrets feature to Replit, the dotenv file (\".env\"). The file followed a line-based ","_key":"f59c582175d64"},{"_type":"span","marks":["code"],"text":"key=\"secret\"","_key":"f59c582175d65"},{"_type":"span","marks":[],"text":" format, which was consumed as environment variables in the code, only exposing the \"key\" part and keeping the secret safe.","_key":"f59c582175d66"}],"markDefs":[{"_key":"9048c016bc25","_type":"link","href":"https://replit.com/site/pricing"},{"_key":"b24918bd3e62","_type":"link","href":"https://replit.com/talk/share"}],"_type":"block","style":"normal"},{"_key":"7dada6c2518f","children":[{"_type":"span","marks":[],"text":"Dotenv served its purpose for our advanced users. They were able to use it to store data and configurations they want to hide. However, dotenv had many shortcomings. Unless people followed a Replit-specific tutorial or went scouring through our docs, the feature was undiscoverable. Beginners required an understanding of environment variables, and an empty free form file was overwhelming.","_key":"7dada6c2518f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"9e64c3094d90","children":[{"_type":"span","marks":[],"text":"The issues of dotenv even extended to the advanced users. The lack of a public standard for dotenv confused people when following external resources and tutorials. Another problem was that the dotenv file was not an actual file. Still, we communicated it as if it were. Some programmers would try to read it from the file system and be confused because it was not there. We did not write dotenv to the filesystem because forking relied on making a copy of the filesystem of a repl. It also gave us the flexibility of encrypting dotenv and taking other security measures to keep everyone's dotenv safe.","_key":"9e64c3094d900"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"58af6ee7d782","children":[{"_type":"span","marks":[],"text":"It has become apparent to us that we needed a better solution. What made the most sense for us is to add a GUI that is easy to use for learners and keeps our advanced users productive.","_key":"58af6ee7d7820"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"916d76daf820","children":[{"_type":"span","_key":"916d76daf8200","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"9d9d65214b9d","children":[{"_type":"span","marks":[],"text":"Adding new secrets is only a couple of clicks away. The key and value format is now a simple form with two text boxes. You can add multiline secret values, which was a common source of confusion for people using dotenv. The sidebar comes packed with inline documentation, but more importantly, a code inserter for all your favorite languages, so using your keys is also a click away. We also decided to hide the values by default since they are usually sensitive. You can click on a key to see the secret value and edit it. We created an introductory tour to guide users when they open the sidebar for the first time.","_key":"9d9d65214b9d0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"341e8c856a61","children":[{"_type":"span","marks":[],"text":"For now, the primary purpose of the feature is to hide secrets. In the future, you can use it to configure different environments (i.e., production/development) for a repl when we launch \"Deployments\". This change will also unlock some features for us such as retaining ","_key":"341e8c856a610"},{"_type":"span","marks":["code"],"text":"key","_key":"341e8c856a611"},{"_type":"span","marks":[],"text":"s when someone forks a repl with secrets.","_key":"341e8c856a612"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"6750a9a3f026","children":[{"_type":"span","marks":[],"text":"Look for a lock icon in your repl's sidebar to store and use your ","_key":"6750a9a3f0260"},{"_type":"span","marks":["code"],"text":"SUPER_SECRET_KEY","_key":"6750a9a3f0261"},{"_type":"span","marks":[],"text":". You can visit the docs for further reading ","_key":"6750a9a3f0262"},{"_type":"span","marks":["fecb3e42844c"],"text":"https://docs.replit.com/repls/secrets-environment-variables","_key":"6750a9a3f0263"},{"_type":"span","marks":[],"text":".","_key":"6750a9a3f0264"}],"markDefs":[{"_key":"fecb3e42844c","_type":"link","href":"https://docs.replit.com/repls/secrets-environment-variables"}],"_type":"block","style":"normal"},{"_key":"43fc23a41f4e","children":[{"_type":"span","marks":["em"],"text":"Note: If you have an existing dotenv file, we will migrate it to the new GUI. If you face any issues with the migration or have any feedback, please let us know. One common complaint we have received from our beta testers/power users is that the GUI lacks the functionality to copy and paste environment variables between repls quickly. We will be exploring ways to make that possible and keep you productive!","_key":"43fc23a41f4e0"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2021-04-19T00:00:00.000Z"}