{"_id":"post-49dd137b-722d-4b12-b5aa-934d546d11e1","_type":"post","title":"Check out my Repl!","slug":{"_type":"slug","current":"sessions-repls"},"body":[{"_key":"e99196da6d6f","children":[{"_type":"span","marks":[],"text":"The label \"sessions\" is very near and dear to my heart. I vividly remember how Amjad came up with the name and why. After we learned that people would like to create accounts on Repl.it, we were trying to figure out what was the main value proposition for creating an account. Of course, it was saving code! But what do you call a list of code projects saved on your account?","_key":"e99196da6d6f0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"1641af754be5","children":[{"_type":"span","marks":[],"text":"In a brainstorming session in the New York City subway (incidentally, on our way to an improv class so naturally we were yes-anding each-other) Amjad suggested the name \"sessions\"! He continued \"this will be a feed of sesssions that you create and manage\".","_key":"1641af754be50"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"cfee5f6fa194","children":[{"_type":"span","marks":[],"text":"But let's be honest \"sessions\" is kind of boring and somewhat bland. So if Repl-it is about Repl-ing, what is the thing that you save? It's of course a Repl! In fact, some of our users already call it that: \"I made a repl\". So going forward we're going to use \"Repl\" instead of \"Session\".","_key":"cfee5f6fa1940"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"f5f2b31fe3dd","children":[{"_type":"span","marks":[],"text":"When you log in you'll see that the \"sessions\" list is now a \"Repls\" list. And an individual \"session\" is a \"Repl\". Not much else will change. But you'll be happy to know that we're designing a place where you can showcase your Repls and share them with the rest of our community.","_key":"f5f2b31fe3dd0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"ea3d295086e9","children":[{"_type":"span","marks":[],"text":"Happy Repling!!","_key":"ea3d295086e90"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"0b251e5d6b09","children":[{"_type":"span","_key":"0b251e5d6b090","text":"","marks":[]}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2017-05-29T20:46:55.849Z"}