{"_id":"post-38bb5b89-bdec-45be-ae08-50bece20d932","_type":"post","title":"wow ot is hard","slug":{"_type":"slug","current":"sup_bro"},"body":[{"_key":"a026e16baa50","children":[{"_type":"span","marks":[],"text":"history of code editing on repl.it ","_key":"a026e16baa500"}],"markDefs":[],"_type":"block","style":"normal","level":1,"listItem":"bullet"},{"_key":"a3c958135b0c","children":[{"_type":"span","marks":[],"text":"writing to db sending every file on every run enter file system","_key":"a3c958135b0c0"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"6eb5dc64f54f","children":[{"_type":"span","marks":[],"text":"writing to gcs","_key":"6eb5dc64f54f0"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"211703495d54","children":[{"_type":"span","marks":[],"text":"writing to container to gcs","_key":"211703495d540"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"ecc46d941251","children":[{"_type":"span","marks":[],"text":"MULTIPLAYER & OT","_key":"ecc46d9412510"}],"markDefs":[],"_type":"block","style":"normal","level":2,"listItem":"bullet"},{"_key":"9fc11591f2cc","children":[{"_type":"span","marks":[],"text":"added extra problems","_key":"9fc11591f2cc0"}],"markDefs":[],"_type":"block","style":"normal","level":3,"listItem":"bullet"},{"_key":"ac7bc2b2c3ab","children":[{"_type":"span","marks":[],"text":"When your start-up is in its infancy, you take as many shortcuts as you can to get to market, validate your idea, and provide a service to people as soon as possible. Over the years, we rewrote the file infrastructure for Repl.it went multiple times; each step of the way was motivated by a product feature or unlocking capabilities for the user.","_key":"ac7bc2b2c3ab0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"7b8efdea4a02","children":[{"_type":"span","marks":[],"text":"When we first started, all code execution was client-side, and there was no concept of files; each project had a single file. To run the code you typed into the editor, we get the editor's content and run it through a function that outputs your program's result to the console. Similarly, to allow you to share your code and find it the next time you visit the website, we periodically sent the editor's content to the database, stored along-side the project's metadata in a column called \"editor_content.\" Client-side code evaluation worked well and got us far. Still, it's limiting. Many languages cannot run in the browser, not to mention the plethora of things you can do if you had an actual machine, such as creating a server or using the filesystem.","_key":"7b8efdea4a020"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"c90755e488f3","children":[{"_type":"span","marks":[],"text":"Moving the evaluation to the server didn't change the way we dealt with files. The only difference was that instead of running the editor's content through a local function, we sent the content to the server to evaluate it. However, people started expecting more and more from our platform. They expected to interact with the filesystem programmatically, wanted multiple files in their repls, etc. We made the right decision early on adopting containers (TODO link to container explanation) as our sandboxing solution, which meant each user has their own machine to work with, and all the expectations above were readily possible.","_key":"c90755e488f30"}],"markDefs":[],"_type":"block","style":"normal"}]}