{"_id":"post-224e7051-6b83-45d5-9191-9fd893bb749d","_type":"post","title":"Collaborate with Other Teachers in your Classrooms","slug":{"_type":"slug","current":"teacher-collaboration"},"body":[{"_key":"30458204d89d","children":[{"_type":"span","marks":[],"text":"Hey teachers, we've noticed that you have been teaching up a storm in your Replit classrooms, and with this feature we want to turn those storms into educational hurricanes! To do so, we implemented teacher collaboration, which allows you to add an additional teacher to your Replit classrooms. This additional teacher can do ","_key":"30458204d89d0"},{"_type":"span","marks":["em"],"text":"almost","_key":"30458204d89d1"},{"_type":"span","marks":[],"text":" everything you can do, excluding a couple of small destructive things...","_key":"30458204d89d2"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"821cf19f282e","children":[{"_type":"span","marks":[],"text":"This creates the potential to double the teaching throughput in your classrooms, but be careful to invite the right teacher, as you're only allowed 1! Reason being, is we're working on a pro version for teachers. There's a lot that needs to be done before the pro version is released, but we want to emphasize that any features that are currently available for free, will always be free. We will be very transparent about what features might exist under the pro umbrella, and more than one additional teacher is the first.","_key":"821cf19f282e0"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"3b19f75d1987","children":[{"_type":"span","marks":[],"text":"Heres a quick example of how you add an additional teacher: ","_key":"3b19f75d19870"},{"_type":"span","marks":["em"],"text":"Adding an additional teacher","_key":"3b19f75d19871"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"76ca20586ce6","children":[{"_type":"span","marks":[],"text":"We know how hard your job can be, and we want to help by working with you to create the best possible tool for educating your students. Don't hesitate to reach out to us with any feedback, or just to say hi 😀","_key":"76ca20586ce60"}],"markDefs":[],"_type":"block","style":"normal"},{"_key":"d4db4922d914","children":[{"_type":"span","marks":[],"text":"Teach on!","_key":"d4db4922d9140"}],"markDefs":[],"_type":"block","style":"normal"}],"publishedAt":"2017-02-15T08:00:00.000Z"}